zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp135cxx_ca7.h
/***************  Bit definition for DCMIPP_P0DCLMTR register  ****************/
#define DCMIPP_P0DCLMTR_LIMIT_Pos         (0U)
#define DCMIPP_P0DCLMTR_LIMIT_Msk         (0xFFFFFFUL << DCMIPP_P0DCLMTR_LIMIT_Pos)      /*!< 0x00FFFFFF */
#define DCMIPP_P0DCLMTR_LIMIT             DCMIPP_P0DCLMTR_LIMIT_Msk                     /*!< maximum number of 32bit data that can be dumped during a frame, after the crop 2D operation. */
#define DCMIPP_P0DCLMTR_LIMIT_0           (0x1UL << DCMIPP_P0DCLMTR_LIMIT_Pos)           /*!< 0x00000001 */
#define DCMIPP_P0DCLMTR_LIMIT_1           (0x2UL << DCMIPP_P0DCLMTR_LIMIT_Pos)           /*!< 0x00000002 */
#define DCMIPP_P0DCLMTR_LIMIT_2           (0x4UL << DCMIPP_P0DCLMTR_LIMIT_Pos)           /*!< 0x00000004 */
#define DCMIPP_P0DCLMTR_LIMIT_3           (0x8UL << DCMIPP_P0DCLMTR_LIMIT_Pos)           /*!< 0x00000008 */
#define DCMIPP_P0DCLMTR_LIMIT_4           (0x10UL << DCMIPP_P0DCLMTR_LIMIT_Pos)          /*!< 0x00000010 */
#define DCMIPP_P0DCLMTR_LIMIT_5           (0x20UL << DCMIPP_P0DCLMTR_LIMIT_Pos)          /*!< 0x00000020 */
#define DCMIPP_P0DCLMTR_LIMIT_6           (0x40UL << DCMIPP_P0DCLMTR_LIMIT_Pos)          /*!< 0x00000040 */
#define DCMIPP_P0DCLMTR_LIMIT_7           (0x80UL << DCMIPP_P0DCLMTR_LIMIT_Pos)          /*!< 0x00000080 */
#define DCMIPP_P0DCLMTR_LIMIT_8           (0x100UL << DCMIPP_P0DCLMTR_LIMIT_Pos)         /*!< 0x00000100 */
#define DCMIPP_P0DCLMTR_LIMIT_9           (0x200UL << DCMIPP_P0DCLMTR_LIMIT_Pos)         /*!< 0x00000200 */
#define DCMIPP_P0DCLMTR_LIMIT_10          (0x400UL << DCMIPP_P0DCLMTR_LIMIT_Pos)         /*!< 0x00000400 */
#define DCMIPP_P0DCLMTR_LIMIT_11          (0x800UL << DCMIPP_P0DCLMTR_LIMIT_Pos)         /*!< 0x00000800 */
#define DCMIPP_P0DCLMTR_LIMIT_12          (0x1000UL << DCMIPP_P0DCLMTR_LIMIT_Pos)        /*!< 0x00001000 */
#define DCMIPP_P0DCLMTR_LIMIT_13          (0x2000UL << DCMIPP_P0DCLMTR_LIMIT_Pos)        /*!< 0x00002000 */
#define DCMIPP_P0DCLMTR_LIMIT_14          (0x4000UL << DCMIPP_P0DCLMTR_LIMIT_Pos)        /*!< 0x00004000 */
#define DCMIPP_P0DCLMTR_LIMIT_15          (0x8000UL << DCMIPP_P0DCLMTR_LIMIT_Pos)        /*!< 0x00008000 */
#define DCMIPP_P0DCLMTR_LIMIT_16          (0x10000UL << DCMIPP_P0DCLMTR_LIMIT_Pos)       /*!< 0x00010000 */
#define DCMIPP_P0DCLMTR_LIMIT_17          (0x20000UL << DCMIPP_P0DCLMTR_LIMIT_Pos)       /*!< 0x00020000 */
#define DCMIPP_P0DCLMTR_LIMIT_18          (0x40000UL << DCMIPP_P0DCLMTR_LIMIT_Pos)       /*!< 0x00040000 */
#define DCMIPP_P0DCLMTR_LIMIT_19          (0x80000UL << DCMIPP_P0DCLMTR_LIMIT_Pos)       /*!< 0x00080000 */
#define DCMIPP_P0DCLMTR_LIMIT_20          (0x100000UL << DCMIPP_P0DCLMTR_LIMIT_Pos)      /*!< 0x00100000 */
#define DCMIPP_P0DCLMTR_LIMIT_21          (0x200000UL << DCMIPP_P0DCLMTR_LIMIT_Pos)      /*!< 0x00200000 */
#define DCMIPP_P0DCLMTR_LIMIT_22          (0x400000UL << DCMIPP_P0DCLMTR_LIMIT_Pos)      /*!< 0x00400000 */
#define DCMIPP_P0DCLMTR_LIMIT_23          (0x800000UL << DCMIPP_P0DCLMTR_LIMIT_Pos)      /*!< 0x00800000 */
#define DCMIPP_P0DCLMTR_ENABLE_Pos        (31U)
#define DCMIPP_P0DCLMTR_ENABLE_Msk        (0x1UL << DCMIPP_P0DCLMTR_ENABLE_Pos)
#define DCMIPP_P0DCLMTR_ENABLE            DCMIPP_P0DCLMTR_ENABLE_Msk

/****************  Bit definition for DCMIPP_P0PPCR register  *****************/
#define DCMIPP_P0PPCR_PAD_Pos             (5U)
#define DCMIPP_P0PPCR_PAD_Msk             (0x1UL << DCMIPP_P0PPCR_PAD_Pos)               /*!< 0x00000020 */
#define DCMIPP_P0PPCR_PAD                 DCMIPP_P0PPCR_PAD_Msk                         /*!< Pad mode for Monochrome and RawBayer 10/12/14bpp: Msb vs Lsb alignment. */
#define DCMIPP_P0PPCR_BSM_Pos             (7U)
#define DCMIPP_P0PPCR_BSM_Msk             (0x3UL << DCMIPP_P0PPCR_BSM_Pos)               /*!< 0x00000180 */
#define DCMIPP_P0PPCR_BSM                 DCMIPP_P0PPCR_BSM_Msk                         /*!< Byte Select mode */
#define DCMIPP_P0PPCR_BSM_0               (0x1UL << DCMIPP_P0PPCR_BSM_Pos)              /*!< 0x00000080 */
#define DCMIPP_P0PPCR_BSM_1               (0x2UL << DCMIPP_P0PPCR_BSM_Pos)             /*!< 0x00000100 */
#define DCMIPP_P0PPCR_OEBS_Pos            (9U)
#define DCMIPP_P0PPCR_OEBS_Msk            (0x1UL << DCMIPP_P0PPCR_OEBS_Pos)              /*!< 0x00000200 */
#define DCMIPP_P0PPCR_OEBS                DCMIPP_P0PPCR_OEBS_Msk                        /*!< Odd/Even Byte Select (Byte Select Start) */
#define DCMIPP_P0PPCR_LSM_Pos             (10U)
#define DCMIPP_P0PPCR_LSM_Msk             (0x1UL << DCMIPP_P0PPCR_LSM_Pos)               /*!< 0x00000400 */
#define DCMIPP_P0PPCR_LSM                 DCMIPP_P0PPCR_LSM_Msk                         /*!< Line Select mode */
#define DCMIPP_P0PPCR_OELS_Pos            (11U)
#define DCMIPP_P0PPCR_OELS_Msk            (0x1UL << DCMIPP_P0PPCR_OELS_Pos)              /*!< 0x00000800 */
#define DCMIPP_P0PPCR_OELS                DCMIPP_P0PPCR_OELS_Msk                        /*!< Odd/Even Line Select (Line Select Start) */
#define DCMIPP_P0PPCR_LINEMULT_Pos        (13U)
#define DCMIPP_P0PPCR_LINEMULT_Msk        (0x7UL << DCMIPP_P0PPCR_LINEMULT_Pos)          /*!< 0x0000E000 */
#define DCMIPP_P0PPCR_LINEMULT            DCMIPP_P0PPCR_LINEMULT_Msk                    /*!< amount of capture completed lines for LINE Event and Interrupt */
#define DCMIPP_P0PPCR_LINEMULT_0          (0x1UL << DCMIPP_P0PPCR_LINEMULT_Pos)       /*!< 0x00002000 */
#define DCMIPP_P0PPCR_LINEMULT_1          (0x2UL << DCMIPP_P0PPCR_LINEMULT_Pos)       /*!< 0x00004000 */
#define DCMIPP_P0PPCR_LINEMULT_2          (0x4UL << DCMIPP_P0PPCR_LINEMULT_Pos)       /*!< 0x00008000 */
#define DCMIPP_P0PPCR_DBM_Pos             (16U)
#define DCMIPP_P0PPCR_DBM_Msk             (0x1UL << DCMIPP_P0PPCR_DBM_Pos)               /*!< 0x00010000 */
#define DCMIPP_P0PPCR_DBM                 DCMIPP_P0PPCR_DBM_Msk                         /*!< Double buffer mode */

/***************  Bit definition for DCMIPP_P0PPM0AR1 register  ***************/
#define DCMIPP_P0PPM0AR1_M0A_Pos          (0U)
#define DCMIPP_P0PPM0AR1_M0A_Msk          (0xFFFFFFFFUL << DCMIPP_P0PPM0AR1_M0A_Pos)     /*!< 0xFFFFFFFF */
#define DCMIPP_P0PPM0AR1_M0A              DCMIPP_P0PPM0AR1_M0A_Msk                      /*!< memory 0 address */
#define DCMIPP_P0PPM0AR1_M0A_0            (0x1UL << DCMIPP_P0PPM0AR1_M0A_Pos)            /*!< 0x00000001 */
#define DCMIPP_P0PPM0AR1_M0A_1            (0x2UL << DCMIPP_P0PPM0AR1_M0A_Pos)            /*!< 0x00000002 */
#define DCMIPP_P0PPM0AR1_M0A_2            (0x4UL << DCMIPP_P0PPM0AR1_M0A_Pos)            /*!< 0x00000004 */
#define DCMIPP_P0PPM0AR1_M0A_3            (0x8UL << DCMIPP_P0PPM0AR1_M0A_Pos)            /*!< 0x00000008 */
#define DCMIPP_P0PPM0AR1_M0A_4            (0x10UL << DCMIPP_P0PPM0AR1_M0A_Pos)           /*!< 0x00000010 */
#define DCMIPP_P0PPM0AR1_M0A_5            (0x20UL << DCMIPP_P0PPM0AR1_M0A_Pos)           /*!< 0x00000020 */
#define DCMIPP_P0PPM0AR1_M0A_6            (0x40UL << DCMIPP_P0PPM0AR1_M0A_Pos)           /*!< 0x00000040 */
#define DCMIPP_P0PPM0AR1_M0A_7            (0x80UL << DCMIPP_P0PPM0AR1_M0A_Pos)           /*!< 0x00000080 */
#define DCMIPP_P0PPM0AR1_M0A_8            (0x100UL << DCMIPP_P0PPM0AR1_M0A_Pos)          /*!< 0x00000100 */
#define DCMIPP_P0PPM0AR1_M0A_9            (0x200UL << DCMIPP_P0PPM0AR1_M0A_Pos)          /*!< 0x00000200 */
#define DCMIPP_P0PPM0AR1_M0A_10           (0x400UL << DCMIPP_P0PPM0AR1_M0A_Pos)          /*!< 0x00000400 */
#define DCMIPP_P0PPM0AR1_M0A_11           (0x800UL << DCMIPP_P0PPM0AR1_M0A_Pos)          /*!< 0x00000800 */
#define DCMIPP_P0PPM0AR1_M0A_12           (0x1000UL << DCMIPP_P0PPM0AR1_M0A_Pos)         /*!< 0x00001000 */
#define DCMIPP_P0PPM0AR1_M0A_13           (0x2000UL << DCMIPP_P0PPM0AR1_M0A_Pos)         /*!< 0x00002000 */
#define DCMIPP_P0PPM0AR1_M0A_14           (0x4000UL << DCMIPP_P0PPM0AR1_M0A_Pos)         /*!< 0x00004000 */
#define DCMIPP_P0PPM0AR1_M0A_15           (0x8000UL << DCMIPP_P0PPM0AR1_M0A_Pos)         /*!< 0x00008000 */
#define DCMIPP_P0PPM0AR1_M0A_16           (0x10000UL << DCMIPP_P0PPM0AR1_M0A_Pos)        /*!< 0x00010000 */
#define DCMIPP_P0PPM0AR1_M0A_17           (0x20000UL << DCMIPP_P0PPM0AR1_M0A_Pos)        /*!< 0x00020000 */
#define DCMIPP_P0PPM0AR1_M0A_18           (0x40000UL << DCMIPP_P0PPM0AR1_M0A_Pos)        /*!< 0x00040000 */
#define DCMIPP_P0PPM0AR1_M0A_19           (0x80000UL << DCMIPP_P0PPM0AR1_M0A_Pos)        /*!< 0x00080000 */
#define DCMIPP_P0PPM0AR1_M0A_20           (0x100000UL << DCMIPP_P0PPM0AR1_M0A_Pos)       /*!< 0x00100000 */
#define DCMIPP_P0PPM0AR1_M0A_21           (0x200000UL << DCMIPP_P0PPM0AR1_M0A_Pos)       /*!< 0x00200000 */
#define DCMIPP_P0PPM0AR1_M0A_22           (0x400000UL << DCMIPP_P0PPM0AR1_M0A_Pos)       /*!< 0x00400000 */
#define DCMIPP_P0PPM0AR1_M0A_23           (0x800000UL << DCMIPP_P0PPM0AR1_M0A_Pos)       /*!< 0x00800000 */
#define DCMIPP_P0PPM0AR1_M0A_24           (0x1000000UL << DCMIPP_P0PPM0AR1_M0A_Pos)      /*!< 0x01000000 */
#define DCMIPP_P0PPM0AR1_M0A_25           (0x2000000UL << DCMIPP_P0PPM0AR1_M0A_Pos)      /*!< 0x02000000 */
#define DCMIPP_P0PPM0AR1_M0A_26           (0x4000000UL << DCMIPP_P0PPM0AR1_M0A_Pos)      /*!< 0x04000000 */
#define DCMIPP_P0PPM0AR1_M0A_27           (0x8000000UL << DCMIPP_P0PPM0AR1_M0A_Pos)      /*!< 0x08000000 */
#define DCMIPP_P0PPM0AR1_M0A_28           (0x10000000UL << DCMIPP_P0PPM0AR1_M0A_Pos)     /*!< 0x10000000 */
#define DCMIPP_P0PPM0AR1_M0A_29           (0x20000000UL << DCMIPP_P0PPM0AR1_M0A_Pos)     /*!< 0x20000000 */
#define DCMIPP_P0PPM0AR1_M0A_30           (0x40000000UL << DCMIPP_P0PPM0AR1_M0A_Pos)     /*!< 0x40000000 */
#define DCMIPP_P0PPM0AR1_M0A_31           (0x80000000UL << DCMIPP_P0PPM0AR1_M0A_Pos)     /*!< 0x80000000 */

/***************  Bit definition for DCMIPP_P0PPM0AR2 register  ***************/
#define DCMIPP_P0PPM0AR2_M0A_Pos          (0U)
#define DCMIPP_P0PPM0AR2_M0A_Msk          (0xFFFFFFFFUL << DCMIPP_P0PPM0AR2_M0A_Pos)     /*!< 0xFFFFFFFF */
#define DCMIPP_P0PPM0AR2_M0A              DCMIPP_P0PPM0AR2_M0A_Msk                      /*!< memory 0 address */
#define DCMIPP_P0PPM0AR2_M0A_0            (0x1UL << DCMIPP_P0PPM0AR2_M0A_Pos)            /*!< 0x00000001 */
#define DCMIPP_P0PPM0AR2_M0A_1            (0x2UL << DCMIPP_P0PPM0AR2_M0A_Pos)            /*!< 0x00000002 */
#define DCMIPP_P0PPM0AR2_M0A_2            (0x4UL << DCMIPP_P0PPM0AR2_M0A_Pos)            /*!< 0x00000004 */
#define DCMIPP_P0PPM0AR2_M0A_3            (0x8UL << DCMIPP_P0PPM0AR2_M0A_Pos)            /*!< 0x00000008 */
#define DCMIPP_P0PPM0AR2_M0A_4            (0x10UL << DCMIPP_P0PPM0AR2_M0A_Pos)           /*!< 0x00000010 */
#define DCMIPP_P0PPM0AR2_M0A_5            (0x20UL << DCMIPP_P0PPM0AR2_M0A_Pos)           /*!< 0x00000020 */
#define DCMIPP_P0PPM0AR2_M0A_6            (0x40UL << DCMIPP_P0PPM0AR2_M0A_Pos)           /*!< 0x00000040 */
#define DCMIPP_P0PPM0AR2_M0A_7            (0x80UL << DCMIPP_P0PPM0AR2_M0A_Pos)           /*!< 0x00000080 */
#define DCMIPP_P0PPM0AR2_M0A_8            (0x100UL << DCMIPP_P0PPM0AR2_M0A_Pos)          /*!< 0x00000100 */
#define DCMIPP_P0PPM0AR2_M0A_9            (0x200UL << DCMIPP_P0PPM0AR2_M0A_Pos)          /*!< 0x00000200 */
#define DCMIPP_P0PPM0AR2_M0A_10           (0x400UL << DCMIPP_P0PPM0AR2_M0A_Pos)          /*!< 0x00000400 */
#define DCMIPP_P0PPM0AR2_M0A_11           (0x800UL << DCMIPP_P0PPM0AR2_M0A_Pos)          /*!< 0x00000800 */
#define DCMIPP_P0PPM0AR2_M0A_12           (0x1000UL << DCMIPP_P0PPM0AR2_M0A_Pos)         /*!< 0x00001000 */
#define DCMIPP_P0PPM0AR2_M0A_13           (0x2000UL << DCMIPP_P0PPM0AR2_M0A_Pos)         /*!< 0x00002000 */
#define DCMIPP_P0PPM0AR2_M0A_14           (0x4000UL << DCMIPP_P0PPM0AR2_M0A_Pos)         /*!< 0x00004000 */
#define DCMIPP_P0PPM0AR2_M0A_15           (0x8000UL << DCMIPP_P0PPM0AR2_M0A_Pos)         /*!< 0x00008000 */
#define DCMIPP_P0PPM0AR2_M0A_16           (0x10000UL << DCMIPP_P0PPM0AR2_M0A_Pos)        /*!< 0x00010000 */
#define DCMIPP_P0PPM0AR2_M0A_17           (0x20000UL << DCMIPP_P0PPM0AR2_M0A_Pos)        /*!< 0x00020000 */
#define DCMIPP_P0PPM0AR2_M0A_18           (0x40000UL << DCMIPP_P0PPM0AR2_M0A_Pos)        /*!< 0x00040000 */
#define DCMIPP_P0PPM0AR2_M0A_19           (0x80000UL << DCMIPP_P0PPM0AR2_M0A_Pos)        /*!< 0x00080000 */
#define DCMIPP_P0PPM0AR2_M0A_20           (0x100000UL << DCMIPP_P0PPM0AR2_M0A_Pos)       /*!< 0x00100000 */
#define DCMIPP_P0PPM0AR2_M0A_21           (0x200000UL << DCMIPP_P0PPM0AR2_M0A_Pos)       /*!< 0x00200000 */
#define DCMIPP_P0PPM0AR2_M0A_22           (0x400000UL << DCMIPP_P0PPM0AR2_M0A_Pos)       /*!< 0x00400000 */
#define DCMIPP_P0PPM0AR2_M0A_23           (0x800000UL << DCMIPP_P0PPM0AR2_M0A_Pos)       /*!< 0x00800000 */
#define DCMIPP_P0PPM0AR2_M0A_24           (0x1000000UL << DCMIPP_P0PPM0AR2_M0A_Pos)      /*!< 0x01000000 */
#define DCMIPP_P0PPM0AR2_M0A_25           (0x2000000UL << DCMIPP_P0PPM0AR2_M0A_Pos)      /*!< 0x02000000 */
#define DCMIPP_P0PPM0AR2_M0A_26           (0x4000000UL << DCMIPP_P0PPM0AR2_M0A_Pos)      /*!< 0x04000000 */
#define DCMIPP_P0PPM0AR2_M0A_27           (0x8000000UL << DCMIPP_P0PPM0AR2_M0A_Pos)      /*!< 0x08000000 */
#define DCMIPP_P0PPM0AR2_M0A_28           (0x10000000UL << DCMIPP_P0PPM0AR2_M0A_Pos)     /*!< 0x10000000 */
#define DCMIPP_P0PPM0AR2_M0A_29           (0x20000000UL << DCMIPP_P0PPM0AR2_M0A_Pos)     /*!< 0x20000000 */
#define DCMIPP_P0PPM0AR2_M0A_30           (0x40000000UL << DCMIPP_P0PPM0AR2_M0A_Pos)     /*!< 0x40000000 */
#define DCMIPP_P0PPM0AR2_M0A_31           (0x80000000UL << DCMIPP_P0PPM0AR2_M0A_Pos)     /*!< 0x80000000 */

/*****************  Bit definition for DCMIPP_P0IER register  *****************/
#define DCMIPP_P0IER_LINEIE_Pos           (0U)
#define DCMIPP_P0IER_LINEIE_Msk           (0x1UL << DCMIPP_P0IER_LINEIE_Pos)             /*!< 0x00000001 */
#define DCMIPP_P0IER_LINEIE               DCMIPP_P0IER_LINEIE_Msk                       /*!< multi-Line Capture completed interrupt enable */
#define DCMIPP_P0IER_FRAMEIE_Pos          (1U)
#define DCMIPP_P0IER_FRAMEIE_Msk          (0x1UL << DCMIPP_P0IER_FRAMEIE_Pos)            /*!< 0x00000002 */
#define DCMIPP_P0IER_FRAMEIE              DCMIPP_P0IER_FRAMEIE_Msk                      /*!< Frame Capture completed interrupt enable */
#define DCMIPP_P0IER_VSYNCIE_Pos          (2U)
#define DCMIPP_P0IER_VSYNCIE_Msk          (0x1UL << DCMIPP_P0IER_VSYNCIE_Pos)            /*!< 0x00000004 */
#define DCMIPP_P0IER_VSYNCIE              DCMIPP_P0IER_VSYNCIE_Msk                      /*!< VSYNC interrupt enable */
#define DCMIPP_P0IER_LIMITIE_Pos          (6U)
#define DCMIPP_P0IER_LIMITIE_Msk          (0x1UL << DCMIPP_P0IER_LIMITIE_Pos)            /*!< 0x00000040 */
#define DCMIPP_P0IER_LIMITIE              DCMIPP_P0IER_LIMITIE_Msk                      /*!< Limit interrupt enable */
#define DCMIPP_P0IER_OVRIE_Pos            (7U)
#define DCMIPP_P0IER_OVRIE_Msk            (0x1UL << DCMIPP_P0IER_OVRIE_Pos)              /*!< 0x00000080 */
#define DCMIPP_P0IER_OVRIE                DCMIPP_P0IER_OVRIE_Msk                        /*!< Overrun interrupt enable */

/*****************  Bit definition for DCMIPP_P0SR register  ******************/
#define DCMIPP_P0SR_LINEF_Pos             (0U)
#define DCMIPP_P0SR_LINEF_Msk             (0x1UL << DCMIPP_P0SR_LINEF_Pos)               /*!< 0x00000001 */
#define DCMIPP_P0SR_LINEF                 DCMIPP_P0SR_LINEF_Msk                         /*!< multi-Line Capture completed raw interrupt status */
#define DCMIPP_P0SR_FRAMEF_Pos            (1U)
#define DCMIPP_P0SR_FRAMEF_Msk            (0x1UL << DCMIPP_P0SR_FRAMEF_Pos)              /*!< 0x00000002 */
#define DCMIPP_P0SR_FRAMEF                DCMIPP_P0SR_FRAMEF_Msk                        /*!< Frame Capture completed raw interrupt status */
#define DCMIPP_P0SR_VSYNCF_Pos            (2U)
#define DCMIPP_P0SR_VSYNCF_Msk            (0x1UL << DCMIPP_P0SR_VSYNCF_Pos)              /*!< 0x00000004 */
#define DCMIPP_P0SR_VSYNCF                DCMIPP_P0SR_VSYNCF_Msk                        /*!< VSYNC raw interrupt status */
#define DCMIPP_P0SR_LIMITF_Pos            (6U)
#define DCMIPP_P0SR_LIMITF_Msk            (0x1UL << DCMIPP_P0SR_LIMITF_Pos)              /*!< 0x00000040 */
#define DCMIPP_P0SR_LIMITF                DCMIPP_P0SR_LIMITF_Msk                        /*!< Limit raw interrupt status */
#define DCMIPP_P0SR_OVRF_Pos              (7U)
#define DCMIPP_P0SR_OVRF_Msk              (0x1UL << DCMIPP_P0SR_OVRF_Pos)                /*!< 0x00000080 */
#define DCMIPP_P0SR_OVRF                  DCMIPP_P0SR_OVRF_Msk                          /*!< Overrun raw interrupt status */
#define DCMIPP_P0SR_LSTLINE_Pos           (16U)
#define DCMIPP_P0SR_LSTLINE_Msk           (0x1UL << DCMIPP_P0SR_LSTLINE_Pos)             /*!< 0x00010000 */
#define DCMIPP_P0SR_LSTLINE               DCMIPP_P0SR_LSTLINE_Msk                       /*!< Last Line Lsb bit, sampled at Frame Capture complete event. */
#define DCMIPP_P0SR_CPTACT_Pos            (23U)
#define DCMIPP_P0SR_CPTACT_Msk            (0x1UL << DCMIPP_P0SR_CPTACT_Pos)              /*!< 0x00800000 */
#define DCMIPP_P0SR_CPTACT                DCMIPP_P0SR_CPTACT_Msk                        /*!< Capture immediate status */

/*****************  Bit definition for DCMIPP_P0FCR register  *****************/
#define DCMIPP_P0FCR_CLINEF_Pos           (0U)
#define DCMIPP_P0FCR_CLINEF_Msk           (0x1UL << DCMIPP_P0FCR_CLINEF_Pos)             /*!< 0x00000001 */
#define DCMIPP_P0FCR_CLINEF               DCMIPP_P0FCR_CLINEF_Msk                       /*!< multi-Line Capture complete interrupt status clear */
#define DCMIPP_P0FCR_CFRAMEF_Pos          (1U)
#define DCMIPP_P0FCR_CFRAMEF_Msk          (0x1UL << DCMIPP_P0FCR_CFRAMEF_Pos)            /*!< 0x00000002 */
#define DCMIPP_P0FCR_CFRAMEF              DCMIPP_P0FCR_CFRAMEF_Msk                      /*!< Frame Capture complete interrupt status clear */
#define DCMIPP_P0FCR_CVSYNCF_Pos          (2U)
#define DCMIPP_P0FCR_CVSYNCF_Msk          (0x1UL << DCMIPP_P0FCR_CVSYNCF_Pos)            /*!< 0x00000004 */
#define DCMIPP_P0FCR_CVSYNCF              DCMIPP_P0FCR_CVSYNCF_Msk                      /*!< Vertical synch interrupt status clear */
#define DCMIPP_P0FCR_CLIMITF_Pos          (6U)
#define DCMIPP_P0FCR_CLIMITF_Msk          (0x1UL << DCMIPP_P0FCR_CLIMITF_Pos)            /*!< 0x00000040 */
#define DCMIPP_P0FCR_CLIMITF              DCMIPP_P0FCR_CLIMITF_Msk                      /*!< limit interrupt status clear */
#define DCMIPP_P0FCR_COVRF_Pos            (7U)
#define DCMIPP_P0FCR_COVRF_Msk            (0x1UL << DCMIPP_P0FCR_COVRF_Pos)              /*!< 0x00000080 */
#define DCMIPP_P0FCR_COVRF                DCMIPP_P0FCR_COVRF_Msk                        /*!< Overrun interrupt status clear */

/***************  Bit definition for DCMIPP_P0CFCTCR register  ****************/
#define DCMIPP_P0CFCTCR_FRATE_Pos         (0U)
#define DCMIPP_P0CFCTCR_FRATE_Msk         (0x3UL << DCMIPP_P0CFCTCR_FRATE_Pos)           /*!< 0x00000003 */
#define DCMIPP_P0CFCTCR_FRATE             DCMIPP_P0CFCTCR_FRATE_Msk                     /*!< Frame capture rate control */
#define DCMIPP_P0CFCTCR_FRATE_0           (0x1UL << DCMIPP_P0CFCTCR_FRATE_Pos)           /*!< 0x00000001 */
#define DCMIPP_P0CFCTCR_FRATE_1           (0x2UL << DCMIPP_P0CFCTCR_FRATE_Pos)           /*!< 0x00000002 */
#define DCMIPP_P0CFCTCR_CPTMODE_Pos       (2U)
#define DCMIPP_P0CFCTCR_CPTMODE_Msk       (0x1UL << DCMIPP_P0CFCTCR_CPTMODE_Pos)         /*!< 0x00000004 */
#define DCMIPP_P0CFCTCR_CPTMODE           DCMIPP_P0CFCTCR_CPTMODE_Msk                   /*!< Capture mode */
#define DCMIPP_P0CFCTCR_CPTREQ_Pos        (3U)
#define DCMIPP_P0CFCTCR_CPTREQ_Msk        (0x1UL << DCMIPP_P0CFCTCR_CPTREQ_Pos)          /*!< 0x00000008 */
#define DCMIPP_P0CFCTCR_CPTREQ            DCMIPP_P0CFCTCR_CPTREQ_Msk                    /*!< Capture requested */

/***************  Bit definition for DCMIPP_P0CSCSTR register  ****************/
#define DCMIPP_P0CSCSTR_HSTART_Pos        (0U)
#define DCMIPP_P0CSCSTR_HSTART_Msk        (0xFFFUL << DCMIPP_P0CSCSTR_HSTART_Pos)        /*!< 0x00000FFF */
#define DCMIPP_P0CSCSTR_HSTART            DCMIPP_P0CSCSTR_HSTART_Msk                    /*!< current horizontal start, from 0 to 4094 words wide */
#define DCMIPP_P0CSCSTR_HSTART_0          (0x1UL << DCMIPP_P0CSCSTR_HSTART_Pos)          /*!< 0x00000001 */
#define DCMIPP_P0CSCSTR_HSTART_1          (0x2UL << DCMIPP_P0CSCSTR_HSTART_Pos)          /*!< 0x00000002 */
#define DCMIPP_P0CSCSTR_HSTART_2          (0x4UL << DCMIPP_P0CSCSTR_HSTART_Pos)          /*!< 0x00000004 */
#define DCMIPP_P0CSCSTR_HSTART_3          (0x8UL << DCMIPP_P0CSCSTR_HSTART_Pos)          /*!< 0x00000008 */
#define DCMIPP_P0CSCSTR_HSTART_4          (0x10UL << DCMIPP_P0CSCSTR_HSTART_Pos)         /*!< 0x00000010 */
#define DCMIPP_P0CSCSTR_HSTART_5          (0x20UL << DCMIPP_P0CSCSTR_HSTART_Pos)         /*!< 0x00000020 */
#define DCMIPP_P0CSCSTR_HSTART_6          (0x40UL << DCMIPP_P0CSCSTR_HSTART_Pos)         /*!< 0x00000040 */
#define DCMIPP_P0CSCSTR_HSTART_7          (0x80UL << DCMIPP_P0CSCSTR_HSTART_Pos)         /*!< 0x00000080 */
#define DCMIPP_P0CSCSTR_HSTART_8          (0x100UL << DCMIPP_P0CSCSTR_HSTART_Pos)        /*!< 0x00000100 */
#define DCMIPP_P0CSCSTR_HSTART_9          (0x200UL << DCMIPP_P0CSCSTR_HSTART_Pos)        /*!< 0x00000200 */
#define DCMIPP_P0CSCSTR_HSTART_10         (0x400UL << DCMIPP_P0CSCSTR_HSTART_Pos)        /*!< 0x00000400 */
#define DCMIPP_P0CSCSTR_HSTART_11         (0x800UL << DCMIPP_P0CSCSTR_HSTART_Pos)        /*!< 0x00000800 */
#define DCMIPP_P0CSCSTR_VSTART_Pos        (16U)
#define DCMIPP_P0CSCSTR_VSTART_Msk        (0xFFFUL << DCMIPP_P0CSCSTR_VSTART_Pos)        /*!< 0x0FFF0000 */
#define DCMIPP_P0CSCSTR_VSTART            DCMIPP_P0CSCSTR_VSTART_Msk                    /*!< current vertical start, from 0 to 4094 pixels high. */
#define DCMIPP_P0CSCSTR_VSTART_0          (0x1UL << DCMIPP_P0CSCSTR_VSTART_Pos)      /*!< 0x00010000 */
#define DCMIPP_P0CSCSTR_VSTART_1          (0x2UL << DCMIPP_P0CSCSTR_VSTART_Pos)      /*!< 0x00020000 */
#define DCMIPP_P0CSCSTR_VSTART_2          (0x4UL << DCMIPP_P0CSCSTR_VSTART_Pos)      /*!< 0x00040000 */
#define DCMIPP_P0CSCSTR_VSTART_3          (0x8UL << DCMIPP_P0CSCSTR_VSTART_Pos)      /*!< 0x00080000 */
#define DCMIPP_P0CSCSTR_VSTART_4          (0x10UL << DCMIPP_P0CSCSTR_VSTART_Pos)     /*!< 0x00100000 */
#define DCMIPP_P0CSCSTR_VSTART_5          (0x20UL << DCMIPP_P0CSCSTR_VSTART_Pos)     /*!< 0x00200000 */
#define DCMIPP_P0CSCSTR_VSTART_6          (0x40UL << DCMIPP_P0CSCSTR_VSTART_Pos)     /*!< 0x00400000 */
#define DCMIPP_P0CSCSTR_VSTART_7          (0x80UL << DCMIPP_P0CSCSTR_VSTART_Pos)     /*!< 0x00800000 */
#define DCMIPP_P0CSCSTR_VSTART_8          (0x100UL << DCMIPP_P0CSCSTR_VSTART_Pos)    /*!< 0x01000000 */
#define DCMIPP_P0CSCSTR_VSTART_9          (0x200UL << DCMIPP_P0CSCSTR_VSTART_Pos)    /*!< 0x02000000 */
#define DCMIPP_P0CSCSTR_VSTART_10         (0x400UL << DCMIPP_P0CSCSTR_VSTART_Pos)    /*!< 0x04000000 */
#define DCMIPP_P0CSCSTR_VSTART_11         (0x800UL << DCMIPP_P0CSCSTR_VSTART_Pos)    /*!< 0x08000000 */

