zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp135cxx_ca7.h
/*****************  Bit definition for DCMIPP_IPIDR register  *****************/
#define DCMIPP_IPIDR_IDR_Pos              (0U)
#define DCMIPP_IPIDR_IDR_Msk              (0xFFFFFFFFUL << DCMIPP_IPIDR_IDR_Pos)         /*!< 0xFFFFFFFF */
#define DCMIPP_IPIDR_IDR                  DCMIPP_IPIDR_IDR_Msk                          /*!< Parallel Camera Interface (DCMI) &amp; optional Pixel Processing (PP) */
#define DCMIPP_IPIDR_IDR_0                (0x1UL << DCMIPP_IPIDR_IDR_Pos)                /*!< 0x00000001 */
#define DCMIPP_IPIDR_IDR_1                (0x2UL << DCMIPP_IPIDR_IDR_Pos)                /*!< 0x00000002 */
#define DCMIPP_IPIDR_IDR_2                (0x4UL << DCMIPP_IPIDR_IDR_Pos)                /*!< 0x00000004 */
#define DCMIPP_IPIDR_IDR_3                (0x8UL << DCMIPP_IPIDR_IDR_Pos)                /*!< 0x00000008 */
#define DCMIPP_IPIDR_IDR_4                (0x10UL << DCMIPP_IPIDR_IDR_Pos)               /*!< 0x00000010 */
#define DCMIPP_IPIDR_IDR_5                (0x20UL << DCMIPP_IPIDR_IDR_Pos)               /*!< 0x00000020 */
#define DCMIPP_IPIDR_IDR_6                (0x40UL << DCMIPP_IPIDR_IDR_Pos)               /*!< 0x00000040 */
#define DCMIPP_IPIDR_IDR_7                (0x80UL << DCMIPP_IPIDR_IDR_Pos)               /*!< 0x00000080 */
#define DCMIPP_IPIDR_IDR_8                (0x100UL << DCMIPP_IPIDR_IDR_Pos)              /*!< 0x00000100 */
#define DCMIPP_IPIDR_IDR_9                (0x200UL << DCMIPP_IPIDR_IDR_Pos)              /*!< 0x00000200 */
#define DCMIPP_IPIDR_IDR_10               (0x400UL << DCMIPP_IPIDR_IDR_Pos)              /*!< 0x00000400 */
#define DCMIPP_IPIDR_IDR_11               (0x800UL << DCMIPP_IPIDR_IDR_Pos)              /*!< 0x00000800 */
#define DCMIPP_IPIDR_IDR_12               (0x1000UL << DCMIPP_IPIDR_IDR_Pos)             /*!< 0x00001000 */
#define DCMIPP_IPIDR_IDR_13               (0x2000UL << DCMIPP_IPIDR_IDR_Pos)             /*!< 0x00002000 */
#define DCMIPP_IPIDR_IDR_14               (0x4000UL << DCMIPP_IPIDR_IDR_Pos)             /*!< 0x00004000 */
#define DCMIPP_IPIDR_IDR_15               (0x8000UL << DCMIPP_IPIDR_IDR_Pos)             /*!< 0x00008000 */
#define DCMIPP_IPIDR_IDR_16               (0x10000UL << DCMIPP_IPIDR_IDR_Pos)            /*!< 0x00010000 */
#define DCMIPP_IPIDR_IDR_17               (0x20000UL << DCMIPP_IPIDR_IDR_Pos)            /*!< 0x00020000 */
#define DCMIPP_IPIDR_IDR_18               (0x40000UL << DCMIPP_IPIDR_IDR_Pos)            /*!< 0x00040000 */
#define DCMIPP_IPIDR_IDR_19               (0x80000UL << DCMIPP_IPIDR_IDR_Pos)            /*!< 0x00080000 */
#define DCMIPP_IPIDR_IDR_20               (0x100000UL << DCMIPP_IPIDR_IDR_Pos)           /*!< 0x00100000 */
#define DCMIPP_IPIDR_IDR_21               (0x200000UL << DCMIPP_IPIDR_IDR_Pos)           /*!< 0x00200000 */
#define DCMIPP_IPIDR_IDR_22               (0x400000UL << DCMIPP_IPIDR_IDR_Pos)           /*!< 0x00400000 */
#define DCMIPP_IPIDR_IDR_23               (0x800000UL << DCMIPP_IPIDR_IDR_Pos)           /*!< 0x00800000 */
#define DCMIPP_IPIDR_IDR_24               (0x1000000UL << DCMIPP_IPIDR_IDR_Pos)          /*!< 0x01000000 */
#define DCMIPP_IPIDR_IDR_25               (0x2000000UL << DCMIPP_IPIDR_IDR_Pos)          /*!< 0x02000000 */
#define DCMIPP_IPIDR_IDR_26               (0x4000000UL << DCMIPP_IPIDR_IDR_Pos)          /*!< 0x04000000 */
#define DCMIPP_IPIDR_IDR_27               (0x8000000UL << DCMIPP_IPIDR_IDR_Pos)          /*!< 0x08000000 */
#define DCMIPP_IPIDR_IDR_28               (0x10000000UL << DCMIPP_IPIDR_IDR_Pos)         /*!< 0x10000000 */
#define DCMIPP_IPIDR_IDR_29               (0x20000000UL << DCMIPP_IPIDR_IDR_Pos)         /*!< 0x20000000 */
#define DCMIPP_IPIDR_IDR_30               (0x40000000UL << DCMIPP_IPIDR_IDR_Pos)         /*!< 0x40000000 */
#define DCMIPP_IPIDR_IDR_31               (0x80000000UL << DCMIPP_IPIDR_IDR_Pos)         /*!< 0x80000000 */

/*****************  Bit definition for DCMIPP_SIDR register  ******************/
#define DCMIPP_SIDR_SID_Pos               (0U)
#define DCMIPP_SIDR_SID_Msk               (0xFFFFFFFFUL << DCMIPP_SIDR_SID_Pos)          /*!< 0xFFFFFFFF */
#define DCMIPP_SIDR_SID                   DCMIPP_SIDR_SID_Msk                           /*!< 4KB decoding space */
#define DCMIPP_SIDR_SID_0                 (0x1UL << DCMIPP_SIDR_SID_Pos)                 /*!< 0x00000001 */
#define DCMIPP_SIDR_SID_1                 (0x2UL << DCMIPP_SIDR_SID_Pos)                 /*!< 0x00000002 */
#define DCMIPP_SIDR_SID_2                 (0x4UL << DCMIPP_SIDR_SID_Pos)                 /*!< 0x00000004 */
#define DCMIPP_SIDR_SID_3                 (0x8UL << DCMIPP_SIDR_SID_Pos)                 /*!< 0x00000008 */
#define DCMIPP_SIDR_SID_4                 (0x10UL << DCMIPP_SIDR_SID_Pos)                /*!< 0x00000010 */
#define DCMIPP_SIDR_SID_5                 (0x20UL << DCMIPP_SIDR_SID_Pos)                /*!< 0x00000020 */
#define DCMIPP_SIDR_SID_6                 (0x40UL << DCMIPP_SIDR_SID_Pos)                /*!< 0x00000040 */
#define DCMIPP_SIDR_SID_7                 (0x80UL << DCMIPP_SIDR_SID_Pos)                /*!< 0x00000080 */
#define DCMIPP_SIDR_SID_8                 (0x100UL << DCMIPP_SIDR_SID_Pos)               /*!< 0x00000100 */
#define DCMIPP_SIDR_SID_9                 (0x200UL << DCMIPP_SIDR_SID_Pos)               /*!< 0x00000200 */
#define DCMIPP_SIDR_SID_10                (0x400UL << DCMIPP_SIDR_SID_Pos)               /*!< 0x00000400 */
#define DCMIPP_SIDR_SID_11                (0x800UL << DCMIPP_SIDR_SID_Pos)               /*!< 0x00000800 */
#define DCMIPP_SIDR_SID_12                (0x1000UL << DCMIPP_SIDR_SID_Pos)              /*!< 0x00001000 */
#define DCMIPP_SIDR_SID_13                (0x2000UL << DCMIPP_SIDR_SID_Pos)              /*!< 0x00002000 */
#define DCMIPP_SIDR_SID_14                (0x4000UL << DCMIPP_SIDR_SID_Pos)              /*!< 0x00004000 */
#define DCMIPP_SIDR_SID_15                (0x8000UL << DCMIPP_SIDR_SID_Pos)              /*!< 0x00008000 */
#define DCMIPP_SIDR_SID_16                (0x10000UL << DCMIPP_SIDR_SID_Pos)             /*!< 0x00010000 */
#define DCMIPP_SIDR_SID_17                (0x20000UL << DCMIPP_SIDR_SID_Pos)             /*!< 0x00020000 */
#define DCMIPP_SIDR_SID_18                (0x40000UL << DCMIPP_SIDR_SID_Pos)             /*!< 0x00040000 */
#define DCMIPP_SIDR_SID_19                (0x80000UL << DCMIPP_SIDR_SID_Pos)             /*!< 0x00080000 */
#define DCMIPP_SIDR_SID_20                (0x100000UL << DCMIPP_SIDR_SID_Pos)            /*!< 0x00100000 */
#define DCMIPP_SIDR_SID_21                (0x200000UL << DCMIPP_SIDR_SID_Pos)            /*!< 0x00200000 */
#define DCMIPP_SIDR_SID_22                (0x400000UL << DCMIPP_SIDR_SID_Pos)            /*!< 0x00400000 */
#define DCMIPP_SIDR_SID_23                (0x800000UL << DCMIPP_SIDR_SID_Pos)            /*!< 0x00800000 */
#define DCMIPP_SIDR_SID_24                (0x1000000UL << DCMIPP_SIDR_SID_Pos)           /*!< 0x01000000 */
#define DCMIPP_SIDR_SID_25                (0x2000000UL << DCMIPP_SIDR_SID_Pos)           /*!< 0x02000000 */
#define DCMIPP_SIDR_SID_26                (0x4000000UL << DCMIPP_SIDR_SID_Pos)           /*!< 0x04000000 */
#define DCMIPP_SIDR_SID_27                (0x8000000UL << DCMIPP_SIDR_SID_Pos)           /*!< 0x08000000 */
#define DCMIPP_SIDR_SID_28                (0x10000000UL << DCMIPP_SIDR_SID_Pos)          /*!< 0x10000000 */
#define DCMIPP_SIDR_SID_29                (0x20000000UL << DCMIPP_SIDR_SID_Pos)          /*!< 0x20000000 */
#define DCMIPP_SIDR_SID_30                (0x40000000UL << DCMIPP_SIDR_SID_Pos)          /*!< 0x40000000 */
#define DCMIPP_SIDR_SID_31                (0x80000000UL << DCMIPP_SIDR_SID_Pos)          /*!< 0x80000000 */

/**
  * @brief Analog to Digital Converter
  */

typedef struct
{
  __IO uint32_t ISR;              /*!< ADC Interrupt and Status Register,                 Address offset: 0x00 */
  __IO uint32_t IER;              /*!< ADC Interrupt Enable Register,                     Address offset: 0x04 */
  __IO uint32_t CR;               /*!< ADC control register,                              Address offset: 0x08 */
  __IO uint32_t CFGR;             /*!< ADC Configuration register,                        Address offset: 0x0C */
  __IO uint32_t CFGR2;            /*!< ADC Configuration register 2,                      Address offset: 0x10 */
  __IO uint32_t SMPR1;            /*!< ADC sample time register 1,                        Address offset: 0x14 */
  __IO uint32_t SMPR2;            /*!< ADC sample time register 2,                        Address offset: 0x18 */
  uint32_t RESERVED0;             /*!< Reserved, 0x1C                                                          */
  __IO uint32_t TR1;              /*!< ADC watchdog threshold register 1                  Address offset: 0x20 */
  __IO uint32_t TR2;              /*!< ADC watchdog threshold register 2                  Address offset: 0x24 */
  __IO uint32_t TR3;              /*!< ADC watchdog threshold register 3                  Address offset: 0x28 */
  uint32_t RESERVED1;             /*!< Reserved, 0x2C                                                          */
  __IO uint32_t SQR1;             /*!< ADC regular sequence register 1,                   Address offset: 0x30 */
  __IO uint32_t SQR2;             /*!< ADC regular sequence register 2,                   Address offset: 0x34 */
  __IO uint32_t SQR3;             /*!< ADC regular sequence register 3,                   Address offset: 0x38 */
  __IO uint32_t SQR4;             /*!< ADC regular sequence register 4,                   Address offset: 0x3C */
  __IO uint32_t DR;               /*!< ADC regular data register,                         Address offset: 0x40 */
  uint32_t      RESERVED3;        /*!< Reserved, 0x044                                                         */
  uint32_t      RESERVED4;        /*!< Reserved, 0x048                                                         */
  __IO uint32_t JSQR;             /*!< ADC injected sequence register,                    Address offset: 0x4C */
  uint32_t      RESERVED5[4];     /*!< Reserved, 0x050 - 0x05C                                                 */
  __IO uint32_t OFR1;             /*!< ADC offset register 1,                             Address offset: 0x60 */
  __IO uint32_t OFR2;             /*!< ADC offset register 2,                             Address offset: 0x64 */
  __IO uint32_t OFR3;             /*!< ADC offset register 3,                             Address offset: 0x68 */
  __IO uint32_t OFR4;             /*!< ADC offset register 4,                             Address offset: 0x6C */
  uint32_t      RESERVED6[4];     /*!< Reserved, 0x070 - 0x07C                                                 */
  __IO uint32_t JDR1;             /*!< ADC injected data register 1,                      Address offset: 0x80 */
  __IO uint32_t JDR2;             /*!< ADC injected data register 2,                      Address offset: 0x84 */
  __IO uint32_t JDR3;             /*!< ADC injected data register 3,                      Address offset: 0x88 */
  __IO uint32_t JDR4;             /*!< ADC injected data register 4,                      Address offset: 0x8C */
  uint32_t      RESERVED7[4];     /*!< Reserved, 0x090 - 0x09C                                                 */
  __IO uint32_t AWD2CR;           /*!< ADC  Analog Watchdog 2 Configuration Register,     Address offset: 0xA0 */
  __IO uint32_t AWD3CR;           /*!< ADC  Analog Watchdog 3 Configuration Register,     Address offset: 0xA4 */
  uint32_t      RESERVED8;        /*!< Reserved, 0x0A8                                                         */
  uint32_t      RESERVED9;        /*!< Reserved, 0x0AC                                                         */
  __IO uint32_t DIFSEL;           /*!< ADC Differential mode Selection Register           Address offset: 0xB0 */
  __IO uint32_t CALFACT;          /*!< ADC Calibration Factors                            Address offset: 0xB4 */
  uint32_t      RESERVED10[4];    /*!< Reserved, 0xB8 - 0xC4                                                   */
  __IO uint32_t OR;               /*!< ADC Option Register,                               Address offset: 0xC8 */
  uint32_t  RESERVED11[201];      /*!< Reserved,                                                  0xCC - 0x3EC */
  __IO uint32_t HWCFGR0;          /*!<  ADC hardware configuration register              Address offset: 0x3F0 */
  __IO uint32_t VERR;             /*!< ADC version register,                             Address offset: 0x3F4 */
  __IO uint32_t IPIDR;            /*!< ADC ID register,                                  Address offset: 0x3F8 */
  __IO uint32_t SIDR;             /*!< ADC Size ID register,                             Address offset: 0x3FC */
} ADC_TypeDef;


typedef struct
{
  __IO uint32_t CSR; /*!< ADC Common status register, Address offset: ADC1/3 base address + 0x300 */
  uint32_t RESERVED; /*!< Reserved, ADC1/3 base address + 0x304 */
  __IO uint32_t CCR; /*!< ADC common control register, Address offset: ADC1/3 base address + 0x308 */
} ADC_Common_TypeDef;

/**
  * @brief FD Controller Area Network
  */

typedef struct
{
  __IO uint32_t CREL;         /*!< FDCAN Core Release register,                                     Address offset: 0x000 */
  __IO uint32_t ENDN;         /*!< FDCAN Endian register,                                           Address offset: 0x004 */
  __IO uint32_t RESERVED1;    /*!< Reserved,                                                                        0x008 */
  __IO uint32_t DBTP;         /*!< FDCAN Data Bit Timing & Prescaler register,                      Address offset: 0x00C */
  __IO uint32_t TEST;         /*!< FDCAN Test register,                                             Address offset: 0x010 */
  __IO uint32_t RWD;          /*!< FDCAN RAM Watchdog register,                                     Address offset: 0x014 */
  __IO uint32_t CCCR;         /*!< FDCAN CC Control register,                                       Address offset: 0x018 */
  __IO uint32_t NBTP;         /*!< FDCAN Nominal Bit Timing & Prescaler register,                   Address offset: 0x01C */
  __IO uint32_t TSCC;         /*!< FDCAN Timestamp Counter Configuration register,                  Address offset: 0x020 */
  __IO uint32_t TSCV;         /*!< FDCAN Timestamp Counter Value register,                          Address offset: 0x024 */
  __IO uint32_t TOCC;         /*!< FDCAN Timeout Counter Configuration register,                    Address offset: 0x028 */
  __IO uint32_t TOCV;         /*!< FDCAN Timeout Counter Value register,                            Address offset: 0x02C */
  __IO uint32_t RESERVED2[4]; /*!< Reserved,                                                                0x030 - 0x03C */
  __IO uint32_t ECR;          /*!< FDCAN Error Counter register,                                    Address offset: 0x040 */
  __IO uint32_t PSR;          /*!< FDCAN Protocol Status register,                                  Address offset: 0x044 */
  __IO uint32_t TDCR;         /*!< FDCAN Transmitter Delay Compensation register,                   Address offset: 0x048 */
  __IO uint32_t RESERVED3;    /*!< Reserved,                                                                        0x04C */
  __IO uint32_t IR;           /*!< FDCAN Interrupt register,                                        Address offset: 0x050 */
  __IO uint32_t IE;           /*!< FDCAN Interrupt Enable register,                                 Address offset: 0x054 */
  __IO uint32_t ILS;          /*!< FDCAN Interrupt Line Select register,                            Address offset: 0x058 */
  __IO uint32_t ILE;          /*!< FDCAN Interrupt Line Enable register,                            Address offset: 0x05C */
  __IO uint32_t RESERVED4[8]; /*!< Reserved,                                                                0x060 - 0x07C */
  __IO uint32_t GFC;          /*!< FDCAN Global Filter Configuration register,                      Address offset: 0x080 */
  __IO uint32_t SIDFC;        /*!< FDCAN Standard ID Filter Configuration register,                 Address offset: 0x084 */
  __IO uint32_t XIDFC;        /*!< FDCAN Extended ID Filter Configuration register,                 Address offset: 0x088 */
  __IO uint32_t RESERVED5;    /*!< Reserved,                                                                        0x08C */
  __IO uint32_t XIDAM;        /*!< FDCAN Extended ID AND Mask register,                             Address offset: 0x090 */
  __IO uint32_t HPMS;         /*!< FDCAN High Priority Message Status register,                     Address offset: 0x094 */
  __IO uint32_t NDAT1;        /*!< FDCAN New Data 1 register,                                       Address offset: 0x098 */
  __IO uint32_t NDAT2;        /*!< FDCAN New Data 2 register,                                       Address offset: 0x09C */
  __IO uint32_t RXF0C;        /*!< FDCAN Rx FIFO 0 Configuration register,                          Address offset: 0x0A0 */
  __IO uint32_t RXF0S;        /*!< FDCAN Rx FIFO 0 Status register,                                 Address offset: 0x0A4 */
  __IO uint32_t RXF0A;        /*!< FDCAN Rx FIFO 0 Acknowledge register,                            Address offset: 0x0A8 */
  __IO uint32_t RXBC;         /*!< FDCAN Rx Buffer Configuration register,                          Address offset: 0x0AC */
  __IO uint32_t RXF1C;        /*!< FDCAN Rx FIFO 1 Configuration register,                          Address offset: 0x0B0 */
  __IO uint32_t RXF1S;        /*!< FDCAN Rx FIFO 1 Status register,                                 Address offset: 0x0B4 */
  __IO uint32_t RXF1A;        /*!< FDCAN Rx FIFO 1 Acknowledge register,                            Address offset: 0x0B8 */
  __IO uint32_t RXESC;        /*!< FDCAN Rx Buffer/FIFO Element Size Configuration register,        Address offset: 0x0BC */
  __IO uint32_t TXBC;         /*!< FDCAN Tx Buffer Configuration register,                          Address offset: 0x0C0 */
  __IO uint32_t TXFQS;        /*!< FDCAN Tx FIFO/Queue Status register,                             Address offset: 0x0C4 */
  __IO uint32_t TXESC;        /*!< FDCAN Tx Buffer Element Size Configuration register,             Address offset: 0x0C8 */
  __IO uint32_t TXBRP;        /*!< FDCAN Tx Buffer Request Pending register,                        Address offset: 0x0CC */
  __IO uint32_t TXBAR;        /*!< FDCAN Tx Buffer Add Request register,                            Address offset: 0x0D0 */
  __IO uint32_t TXBCR;        /*!< FDCAN Tx Buffer Cancellation Request register,                   Address offset: 0x0D4 */
  __IO uint32_t TXBTO;        /*!< FDCAN Tx Buffer Transmission Occurred register,                  Address offset: 0x0D8 */
  __IO uint32_t TXBCF;        /*!< FDCAN Tx Buffer Cancellation Finished register,                  Address offset: 0x0DC */
  __IO uint32_t TXBTIE;       /*!< FDCAN Tx Buffer Transmission Interrupt Enable register,          Address offset: 0x0E0 */
  __IO uint32_t TXBCIE;       /*!< FDCAN Tx Buffer Cancellation Finished Interrupt Enable register, Address offset: 0x0E4 */
  __IO uint32_t RESERVED6[2]; /*!< Reserved,                                                                0x0E8 - 0x0EC */
  __IO uint32_t TXEFC;        /*!< FDCAN Tx Event FIFO Configuration register,                      Address offset: 0x0F0 */
  __IO uint32_t TXEFS;        /*!< FDCAN Tx Event FIFO Status register,                             Address offset: 0x0F4 */
  __IO uint32_t TXEFA;        /*!< FDCAN Tx Event FIFO Acknowledge register,                        Address offset: 0x0F8 */
  __IO uint32_t RESERVED7;    /*!< Reserved,                                                                        0x0FC */
} FDCAN_GlobalTypeDef;

/**
  * @brief TTFD Controller Area Network
  */

typedef struct
{
  __IO uint32_t TTTMC;          /*!< TT Trigger Memory Configuration register,    Address offset: 0x100 */
  __IO uint32_t TTRMC;          /*!< TT Reference Message Configuration register, Address offset: 0x104 */
  __IO uint32_t TTOCF;          /*!< TT Operation Configuration register,         Address offset: 0x108 */
  __IO uint32_t TTMLM;          /*!< TT Matrix Limits register,                   Address offset: 0x10C */
  __IO uint32_t TURCF;          /*!< TUR Configuration register,                  Address offset: 0x110 */
  __IO uint32_t TTOCN;          /*!< TT Operation Control register,               Address offset: 0x114 */
  __IO uint32_t TTGTP;          /*!< TT Global Time Preset register,              Address offset: 0x118 */
  __IO uint32_t TTTMK;          /*!< TT Time Mark register,                       Address offset: 0x11C */
  __IO uint32_t TTIR;           /*!< TT Interrupt register,                       Address offset: 0x120 */
  __IO uint32_t TTIE;           /*!< TT Interrupt Enable register,                Address offset: 0x124 */
  __IO uint32_t TTILS;          /*!< TT Interrupt Line Select register,           Address offset: 0x128 */
  __IO uint32_t TTOST;          /*!< TT Operation Status register,                Address offset: 0x12C */
  __IO uint32_t TURNA;          /*!< TT TUR Numerator Actual register,            Address offset: 0x130 */
  __IO uint32_t TTLGT;          /*!< TT Local and Global Time register,           Address offset: 0x134 */
  __IO uint32_t TTCTC;          /*!< TT Cycle Time and Count register,            Address offset: 0x138 */
  __IO uint32_t TTCPT;          /*!< TT Capture Time register,                    Address offset: 0x13C */
  __IO uint32_t TTCSM;          /*!< TT Cycle Sync Mark register,                 Address offset: 0x140 */
  __IO uint32_t RESERVED1[111]; /*!< Reserved,                                            0x144 - 0x2FC */
  __IO uint32_t TTTS;           /*!< TT Trigger Select register,                  Address offset: 0x300 */
} TTCAN_TypeDef;

/**
  * @brief FD Controller Area Network
  */

typedef struct
{
  __IO uint32_t CREL;  /*!< Clock Calibration Unit Core Release register, Address offset: 0x00 */
  __IO uint32_t CCFG;  /*!< Calibration Configuration register,           Address offset: 0x04 */
  __IO uint32_t CSTAT; /*!< Calibration Status register,                  Address offset: 0x08 */
  __IO uint32_t CWD;   /*!< Calibration Watchdog register,                Address offset: 0x0C */
  __IO uint32_t IR;    /*!< CCU Interrupt register,                       Address offset: 0x10 */
  __IO uint32_t IE;    /*!< CCU Interrupt Enable register,                Address offset: 0x14 */
} FDCAN_ClockCalibrationUnit_TypeDef;

/**
  * @brief CRC calculation unit
  */

typedef struct
{
  __IO uint32_t DR;          /*!< CRC Data register,                           Address offset: 0x000 */
  __IO uint32_t IDR;         /*!< CRC Independent data register,               Address offset: 0x004 */
  __IO uint32_t CR;          /*!< CRC Control register,                        Address offset: 0x008 */
  uint32_t      RESERVED2;   /*!< Reserved,                                                    0x00C */
  __IO uint32_t INIT;        /*!< Initial CRC value register,                  Address offset: 0x010 */
  __IO uint32_t POL;         /*!< CRC polynomial register,                     Address offset: 0x014 */
  uint32_t      RESERVED3[247];   /*!< Reserved,                                       0x018 - 0x3F0 */
  __IO uint32_t VERR;        /*!< CRC version register,                        Address offset: 0x3F4 */
  __IO uint32_t IPIDR;       /*!< CRC ID register,                             Address offset: 0x3F8 */
  __IO uint32_t SIDR;        /*!< CRC Size ID register,                        Address offset: 0x3FC */
} CRC_TypeDef;


