zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp135cxx_ca7.h
typedef struct
{
  __IO uint32_t SECCFGR;             /*!< RCC secure configuration register                          Address offset: 0x000 */
       uint32_t RESERVED0[63];       /*!< Reserved                                                   Address offset: 0x004-0x0FC */
  __IO uint32_t MP_SREQSETR;         /*!< RCC stop request set register                              Address offset: 0x100 */
  __IO uint32_t MP_SREQCLRR;         /*!< RCC stop request clear register                            Address offset: 0x104 */
  __IO uint32_t MP_APRSTCR;          /*!< RCC application reset control register                     Address offset: 0x108 */
  __IO uint32_t MP_APRSTSR;          /*!< RCC application reset status register                      Address offset: 0x10C */
  __IO uint32_t PWRLPDLYCR;          /*!< RCC low-power Stop modes delay control register            Address offset: 0x110 */
  __IO uint32_t MP_GRSTCSETR;        /*!< RCC global reset control set register                      Address offset: 0x114 */
  __IO uint32_t BR_RSTSCLRR;         /*!< RCC BOOTROM reset status clear register                    Address offset: 0x118 */
  __IO uint32_t MP_RSTSSETR;         /*!< RCC reset status set register                              Address offset: 0x11C */
  __IO uint32_t MP_RSTSCLRR;         /*!< RCC reset status clear register                            Address offset: 0x120 */
  __IO uint32_t MP_IWDGFZSETR;       /*!< RCC IWDG clock freeze set register                         Address offset: 0x124 */
  __IO uint32_t MP_IWDGFZCLRR;       /*!< RCC IWDG clock freeze clear register                       Address offset: 0x128 */
       uint32_t RESERVED1[53];       /*!< Reserved                                                   Address offset: 0x12C-0x1FC */
  __IO uint32_t MP_CIER;             /*!< RCC clock source interrupt enable register                 Address offset: 0x200 */
  __IO uint32_t MP_CIFR;             /*!< RCC clock source interrupt flag register                   Address offset: 0x204 */
       uint32_t RESERVED2[126];      /*!< Reserved                                                   Address offset: 0x208-0x3FC */
  __IO uint32_t BDCR;                /*!< RCC backup domain control register                         Address offset: 0x400 */
  __IO uint32_t RDLSICR;             /*!< RCC reset duration and LSI control register                Address offset: 0x404 */
       uint32_t RESERVED3[6];        /*!< Reserved                                                   Address offset: 0x408-0x41C */
  __IO uint32_t OCENSETR;            /*!< RCC oscillator clock enable set register                   Address offset: 0x420 */
  __IO uint32_t OCENCLRR;            /*!< RCC oscillator clock enable clear register                 Address offset: 0x424 */
  __IO uint32_t OCRDYR;              /*!< RCC oscillators and MPU and AXI clock ready register       Address offset: 0x428 */
       uint32_t RESERVED4[5];        /*!< Reserved                                                   Address offset: 0x42C-0x43C */
  __IO uint32_t HSICFGR;             /*!< RCC HSI configuration register                             Address offset: 0x440 */
  __IO uint32_t CSICFGR;             /*!< RCC CSI configuration register                             Address offset: 0x444 */
       uint32_t RESERVED5[6];        /*!< Reserved                                                   Address offset: 0x448-0x45C */
  __IO uint32_t MCO1CFGR;            /*!< RCC MCO1 configuration register                            Address offset: 0x460 */
  __IO uint32_t MCO2CFGR;            /*!< RCC MCO2 configuration register                            Address offset: 0x464 */
  __IO uint32_t DBGCFGR;             /*!< RCC debug configuration register                           Address offset: 0x468 */
       uint32_t RESERVED6[5];        /*!< Reserved                                                   Address offset: 0x46C-0x47C */
  __IO uint32_t RCK12SELR;           /*!< RCC PLL1 and PLL2 reference clock selection register       Address offset: 0x480 */
  __IO uint32_t RCK3SELR;            /*!< RCC PLL3 reference clock selection register                Address offset: 0x484 */
  __IO uint32_t RCK4SELR;            /*!< RCC PLL4 reference clock selection register                Address offset: 0x488 */
       uint32_t RESERVED7[5];        /*!< Reserved                                                   Address offset: 0x48C-0x49C */
  __IO uint32_t PLL1CR;              /*!< RCC PLL1 control register                                  Address offset: 0x4A0 */
  __IO uint32_t PLL1CFGR1;           /*!< RCC PLL1 configuration register 1                          Address offset: 0x4A4 */
  __IO uint32_t PLL1CFGR2;           /*!< RCC PLL1 configuration register 2                          Address offset: 0x4A8 */
  __IO uint32_t PLL1FRACR;           /*!< RCC PLL1 fractional register                               Address offset: 0x4AC */
  __IO uint32_t PLL1CSGR;            /*!< RCC PLL1 clock spreading generator register                Address offset: 0x4B0 */
       uint32_t RESERVED8[7];        /*!< Reserved                                                   Address offset: 0x4B4-0x4CC */
  __IO uint32_t PLL2CR;              /*!< RCC PLL2 control register                                  Address offset: 0x4D0 */
  __IO uint32_t PLL2CFGR1;           /*!< RCC PLL2 configuration register 1                          Address offset: 0x4D4 */
  __IO uint32_t PLL2CFGR2;           /*!< RCC PLL2 configuration register 2                          Address offset: 0x4D8 */
  __IO uint32_t PLL2FRACR;           /*!< RCC PLL2 fractional register                               Address offset: 0x4DC */
  __IO uint32_t PLL2CSGR;            /*!< RCC PLL2 clock spreading generator register                Address offset: 0x4E0 */
       uint32_t RESERVED9[7];        /*!< Reserved                                                   Address offset: 0x4E4-0x4FC */
  __IO uint32_t PLL3CR;              /*!< RCC PLL3 control register                                  Address offset: 0x500 */
  __IO uint32_t PLL3CFGR1;           /*!< RCC PLL3 configuration register 1                          Address offset: 0x504 */
  __IO uint32_t PLL3CFGR2;           /*!< RCC PLL3 configuration register 2                          Address offset: 0x508 */
  __IO uint32_t PLL3FRACR;           /*!< RCC PLL3 Fractional register                               Address offset: 0x50C */
  __IO uint32_t PLL3CSGR;            /*!< RCC PLL3 clock spreading generator register                Address offset: 0x510 */
       uint32_t RESERVED10[3];       /*!< Reserved                                                   Address offset: 0x514-0x51C */
  __IO uint32_t PLL4CR;              /*!< RCC PLL4 control register                                  Address offset: 0x520 */
  __IO uint32_t PLL4CFGR1;           /*!< RCC PLL4 configuration register 1                          Address offset: 0x524 */
  __IO uint32_t PLL4CFGR2;           /*!< RCC PLL4 configuration register 2                          Address offset: 0x528 */
  __IO uint32_t PLL4FRACR;           /*!< RCC PLL4 fractional register                               Address offset: 0x52C */
  __IO uint32_t PLL4CSGR;            /*!< RCC PLL4 clock spreading generator register                Address offset: 0x530 */
       uint32_t RESERVED11[3];       /*!< Reserved                                                   Address offset: 0x534-0x53C */
  __IO uint32_t MPCKSELR;            /*!< RCC MPU clock selection register                           Address offset: 0x540 */
  __IO uint32_t ASSCKSELR;           /*!< RCC AXI sub-system clock selection register                Address offset: 0x544 */
  __IO uint32_t MSSCKSELR;           /*!< RCC MLAHB sub-system clock selection register              Address offset: 0x548 */
  __IO uint32_t CPERCKSELR;          /*!< RCC common peripheral kernel clock selection register      Address offset: 0x54C */
       uint32_t RESERVED12[4];       /*!< Reserved                                                   Address offset: 0x550-0x55C */
  __IO uint32_t RTCDIVR;             /*!< RCC RTC clock division register                            Address offset: 0x560 */
  __IO uint32_t MPCKDIVR;            /*!< RCC MPU clock divider register                             Address offset: 0x564 */
  __IO uint32_t AXIDIVR;             /*!< RCC AXI clock divider register                             Address offset: 0x568 */
  __IO uint32_t MLAHBDIVR;           /*!< RCC MLAHB clock divider register                           Address offset: 0x56C */
  __IO uint32_t APB1DIVR;            /*!< RCC APB1 clock divider register                            Address offset: 0x570 */
  __IO uint32_t APB2DIVR;            /*!< RCC APB2 clock divider register                            Address offset: 0x574 */
  __IO uint32_t APB3DIVR;            /*!< RCC APB3 clock divider register                            Address offset: 0x578 */
  __IO uint32_t APB4DIVR;            /*!< RCC APB4 clock divider register                            Address offset: 0x57C */
  __IO uint32_t APB5DIVR;            /*!< RCC APB5 clock divider register                            Address offset: 0x580 */
  __IO uint32_t APB6DIVR;            /*!< RCC APB6 clock divider register                            Address offset: 0x584 */
       uint32_t RESERVED13[6];       /*!< Reserved                                                   Address offset: 0x588-0x59C */
  __IO uint32_t TIMG1PRER;           /*!< RCC APB1 timers group1 prescaler register                  Address offset: 0x5A0 */
  __IO uint32_t TIMG2PRER;           /*!< RCC APB2 timers group2 prescaler register                  Address offset: 0x5A4 */
  __IO uint32_t TIMG3PRER;           /*!< RCC APB6 timers group3 prescaler register                  Address offset: 0x5A8 */
       uint32_t RESERVED14[5];       /*!< Reserved                                                   Address offset: 0x5AC-0x5BC */
  __IO uint32_t DDRITFCR;            /*!< RCC DDR interface control register                         Address offset: 0x5C0 */
       uint32_t RESERVED15[15];      /*!< Reserved                                                   Address offset: 0x5C4-0x5FC */
  __IO uint32_t I2C12CKSELR;         /*!< RCC I2C1 and I2C2 kernel clock selection register          Address offset: 0x600 */
  __IO uint32_t I2C345CKSELR;        /*!< RCC I2C3, I2C4 and I2C5 kernel clock selection register    Address offset: 0x604 */
  __IO uint32_t SPI2S1CKSELR;        /*!< RCC SPI/I2S1 kernel clock selection register               Address offset: 0x608 */
  __IO uint32_t SPI2S23CKSELR;       /*!< RCC SPI/I2S2 and SPI/I2S3 kernel clock selection register  Address offset: 0x60C */
  __IO uint32_t SPI45CKSELR;         /*!< RCC SPI/I2S4 and SPI5 kernel clock selection register      Address offset: 0x610 */
  __IO uint32_t UART12CKSELR;        /*!< RCC USART1 and USART2 kernel clock selection register      Address offset: 0x614 */
  __IO uint32_t UART35CKSELR;        /*!< RCC USART3 and UART5 kernel clock selection register       Address offset: 0x618 */
  __IO uint32_t UART4CKSELR;         /*!< RCC UART4 kernel clock selection register                  Address offset: 0x61C */
  __IO uint32_t UART6CKSELR;         /*!< RCC USART6 kernel clock selection register                 Address offset: 0x620 */
  __IO uint32_t UART78CKSELR;        /*!< RCC UART7 and UART8 kernel clock selection register        Address offset: 0x624 */
  __IO uint32_t LPTIM1CKSELR;        /*!< RCC LPTIM1 kernel clock selection register                 Address offset: 0x628 */
  __IO uint32_t LPTIM23CKSELR;       /*!< RCC LPTIM2 and LPTIM3 kernel clock selection register      Address offset: 0x62C */
  __IO uint32_t LPTIM45CKSELR;       /*!< RCC LPTIM4 and LPTIM5 kernel clock selection register      Address offset: 0x630 */
  __IO uint32_t SAI1CKSELR;          /*!< RCC SAI1 kernel clock selection register                   Address offset: 0x634 */
  __IO uint32_t SAI2CKSELR;          /*!< RCC SAI2 kernel clock selection register                   Address offset: 0x638 */
  __IO uint32_t FDCANCKSELR;         /*!< RCC FDCAN kernel clock selection register                  Address offset: 0x63C */
  __IO uint32_t SPDIFCKSELR;         /*!< RCC SPDIFRX kernel clock selection register                Address offset: 0x640 */
  __IO uint32_t ADC12CKSELR;         /*!< RCC ADC1 and ADC2 kernel clock selection register          Address offset: 0x644 */
  __IO uint32_t SDMMC12CKSELR;       /*!< RCC SDMMC1 and SDMMC2 kernel clock selection register      Address offset: 0x648 */
  __IO uint32_t ETH12CKSELR;         /*!< RCC ETH1 and ETH2 kernel clock selection register          Address offset: 0x64C */
  __IO uint32_t USBCKSELR;           /*!< RCC USB kernel clock selection register                    Address offset: 0x650 */
  __IO uint32_t QSPICKSELR;          /*!< RCC QSPI kernel clock selection register                   Address offset: 0x654 */
  __IO uint32_t FMCCKSELR;           /*!< RCC FMC kernel clock selection register                    Address offset: 0x658 */
  __IO uint32_t RNG1CKSELR;          /*!< RCC RNG1 kernel clock selection register                   Address offset: 0x65C */
  __IO uint32_t STGENCKSELR;         /*!< RCC STGEN clock selection register                         Address offset: 0x660 */
  __IO uint32_t DCMIPPCKSELR;        /*!< RCC DCMIPP kernel clock selection register                 Address offset: 0x664 */
  __IO uint32_t SAESCKSELR;          /*!< RCC SAES kernel clock selection register                   Address offset: 0x668 */
       uint32_t RESERVED16[13];      /*!< Reserved                                                   Address offset: 0x66C-0x69C */
  __IO uint32_t APB1RSTSETR;         /*!< RCC APB1 peripheral reset set register                     Address offset: 0x6A0 */
  __IO uint32_t APB1RSTCLRR;         /*!< RCC APB1 peripheral reset clear register                   Address offset: 0x6A4 */
  __IO uint32_t APB2RSTSETR;         /*!< RCC APB2 peripheral reset set register                     Address offset: 0x6A8 */
  __IO uint32_t APB2RSTCLRR;         /*!< RCC APB2 peripheral reset clear register                   Address offset: 0x6AC */
  __IO uint32_t APB3RSTSETR;         /*!< RCC APB3 peripheral reset set register                     Address offset: 0x6B0 */
  __IO uint32_t APB3RSTCLRR;         /*!< RCC APB3 peripheral reset clear register                   Address offset: 0x6B4 */
  __IO uint32_t APB4RSTSETR;         /*!< RCC APB4 peripheral reset set register                     Address offset: 0x6B8 */
  __IO uint32_t APB4RSTCLRR;         /*!< RCC APB4 peripheral reset clear register                   Address offset: 0x6BC */
  __IO uint32_t APB5RSTSETR;         /*!< RCC APB5 peripheral reset set register                     Address offset: 0x6C0 */
  __IO uint32_t APB5RSTCLRR;         /*!< RCC APB5 peripheral reset clear register                   Address offset: 0x6C4 */
  __IO uint32_t APB6RSTSETR;         /*!< RCC APB6 peripheral reset set register                     Address offset: 0x6C8 */
  __IO uint32_t APB6RSTCLRR;         /*!< RCC APB6 peripheral reset clear register                   Address offset: 0x6CC */
  __IO uint32_t AHB2RSTSETR;         /*!< RCC AHB2 peripheral reset set register                     Address offset: 0x6D0 */
  __IO uint32_t AHB2RSTCLRR;         /*!< RCC AHB2 peripheral reset clear register                   Address offset: 0x6D4 */
       uint32_t RESERVED17[2];       /*!< Reserved                                                   Address offset: 0x6D8-0x6DC */
  __IO uint32_t AHB4RSTSETR;         /*!< RCC AHB4 peripheral reset set register                     Address offset: 0x6E0 */
  __IO uint32_t AHB4RSTCLRR;         /*!< RCC AHB4 peripheral reset clear register                   Address offset: 0x6E4 */
  __IO uint32_t AHB5RSTSETR;         /*!< RCC AHB5 peripheral reset set register                     Address offset: 0x6E8 */
  __IO uint32_t AHB5RSTCLRR;         /*!< RCC AHB5 peripheral reset clear register                   Address offset: 0x6EC */
  __IO uint32_t AHB6RSTSETR;         /*!< RCC AHB6 peripheral reset set register                     Address offset: 0x6F0 */
  __IO uint32_t AHB6RSTCLRR;         /*!< RCC AHB6 peripheral reset clear register                   Address offset: 0x6F4 */
       uint32_t RESERVED18[2];       /*!< Reserved                                                   Address offset: 0x6F8-0x6FC */
  __IO uint32_t MP_APB1ENSETR;       /*!< RCC APB1 peripheral enable set register                    Address offset: 0x700 */
  __IO uint32_t MP_APB1ENCLRR;       /*!< RCC APB1 peripheral enable clear register                  Address offset: 0x704 */
  __IO uint32_t MP_APB2ENSETR;       /*!< RCC APB2 peripheral enable set register                    Address offset: 0x708 */
  __IO uint32_t MP_APB2ENCLRR;       /*!< RCC APB2 peripheral enable clear register                  Address offset: 0x70C */
  __IO uint32_t MP_APB3ENSETR;       /*!< RCC APB3 peripheral enable set register                    Address offset: 0x710 */
  __IO uint32_t MP_APB3ENCLRR;       /*!< RCC APB3 peripheral enable clear register                  Address offset: 0x714 */
  __IO uint32_t MP_S_APB3ENSETR;     /*!< RCC secure APB3 peripheral enable set register             Address offset: 0x718 */
  __IO uint32_t MP_S_APB3ENCLRR;     /*!< RCC secure APB3 peripheral enable clear register           Address offset: 0x71C */
  __IO uint32_t MP_NS_APB3ENSETR;    /*!< RCC non-secure APB3 peripheral enable set register         Address offset: 0x720 */
  __IO uint32_t MP_NS_APB3ENCLRR;    /*!< RCC non-secure APB3 peripheral enable clear register       Address offset: 0x724 */
  __IO uint32_t MP_APB4ENSETR;       /*!< RCC APB4 peripheral enable set register                    Address offset: 0x728 */
  __IO uint32_t MP_APB4ENCLRR;       /*!< RCC APB4 peripheral enable clear register                  Address offset: 0x72C */
  __IO uint32_t MP_S_APB4ENSETR;     /*!< RCC secure APB4 peripheral enable set register             Address offset: 0x730 */
  __IO uint32_t MP_S_APB4ENCLRR;     /*!< RCC secure APB4 peripheral enable clear register           Address offset: 0x734 */
  __IO uint32_t MP_NS_APB4ENSETR;    /*!< RCC non-secure APB4 peripheral enable set register         Address offset: 0x738 */
  __IO uint32_t MP_NS_APB4ENCLRR;    /*!< RCC non-secure APB4 peripheral enable clear register       Address offset: 0x73C */
  __IO uint32_t MP_APB5ENSETR;       /*!< RCC APB5 peripheral enable set register                    Address offset: 0x740 */
  __IO uint32_t MP_APB5ENCLRR;       /*!< RCC APB5 peripheral enable clear register                  Address offset: 0x744 */
  __IO uint32_t MP_APB6ENSETR;       /*!< RCC APB6 peripheral enable set register                    Address offset: 0x748 */
  __IO uint32_t MP_APB6ENCLRR;       /*!< RCC APB6 peripheral enable clear register                  Address offset: 0x74C */
  __IO uint32_t MP_AHB2ENSETR;       /*!< RCC AHB2 peripheral enable set register                    Address offset: 0x750 */
  __IO uint32_t MP_AHB2ENCLRR;       /*!< RCC AHB2 peripheral enable clear register                  Address offset: 0x754 */
       uint32_t RESERVED19[4];       /*!< Reserved                                                   Address offset: 0x758-0x764 */
  __IO uint32_t MP_S_AHB4ENSETR;     /*!< RCC secure AHB4 peripheral enable set register             Address offset: 0x768 */
  __IO uint32_t MP_S_AHB4ENCLRR;     /*!< RCC secure AHB4 peripheral enable clear register           Address offset: 0x76C */
  __IO uint32_t MP_NS_AHB4ENSETR;    /*!< RCC non-secure AHB4 peripheral enable set register         Address offset: 0x770 */
  __IO uint32_t MP_NS_AHB4ENCLRR;    /*!< RCC non-secure AHB4 peripheral enable clear register       Address offset: 0x774 */
  __IO uint32_t MP_AHB5ENSETR;       /*!< RCC AHB5 peripheral enable set register                    Address offset: 0x778 */
  __IO uint32_t MP_AHB5ENCLRR;       /*!< RCC AHB5 peripheral enable clear register                  Address offset: 0x77C */
  __IO uint32_t MP_AHB6ENSETR;       /*!< RCC AHB6 peripheral enable set register                    Address offset: 0x780 */
  __IO uint32_t MP_AHB6ENCLRR;       /*!< RCC AHB6 peripheral enable clear register                  Address offset: 0x784 */
  __IO uint32_t MP_S_AHB6ENSETR;     /*!< RCC secure AHB6 peripheral enable set register             Address offset: 0x788 */
  __IO uint32_t MP_S_AHB6ENCLRR;     /*!< RCC secure AHB6 peripheral enable clear register           Address offset: 0x78C */
  __IO uint32_t MP_NS_AHB6ENSETR;    /*!< RCC non-secure AHB6 peripheral enable set register         Address offset: 0x790 */
  __IO uint32_t MP_NS_AHB6ENCLRR;    /*!< RCC non-secure AHB6 peripheral enable clear register       Address offset: 0x794 */
       uint32_t RESERVED20[26];      /*!< Reserved                                                   Address offset: 0x798-0x7FC */
  __IO uint32_t MP_APB1LPENSETR;     /*!< RCC APB1 Sleep clock enable set register                   Address offset: 0x800 */
  __IO uint32_t MP_APB1LPENCLRR;     /*!< RCC APB1 Sleep clock enable clear register                 Address offset: 0x804 */
  __IO uint32_t MP_APB2LPENSETR;     /*!< RCC APB2 Sleep clock enable set register                   Address offset: 0x808 */
  __IO uint32_t MP_APB2LPENCLRR;     /*!< RCC APB2 Sleep clock enable clear register                 Address offset: 0x80C */
  __IO uint32_t MP_APB3LPENSETR;     /*!< RCC APB3 Sleep clock enable set register                   Address offset: 0x810 */
  __IO uint32_t MP_APB3LPENCLRR;     /*!< RCC APB3 Sleep clock enable clear register                 Address offset: 0x814 */
  __IO uint32_t MP_S_APB3LPENSETR;   /*!< RCC secure APB3 Sleep clock enable set register            Address offset: 0x818 */
  __IO uint32_t MP_S_APB3LPENCLRR;   /*!< RCC secure APB3 Sleep clock enable clear register          Address offset: 0x81C */
  __IO uint32_t MP_NS_APB3LPENSETR;  /*!< RCC non-secure APB3 Sleep clock enable set register        Address offset: 0x820 */
  __IO uint32_t MP_NS_APB3LPENCLRR;  /*!< RCC non-secure APB3 Sleep clock enable clear register      Address offset: 0x824 */
  __IO uint32_t MP_APB4LPENSETR;     /*!< RCC APB4 Sleep clock enable set register                   Address offset: 0x828 */
  __IO uint32_t MP_APB4LPENCLRR;     /*!< RCC APB4 Sleep clock enable clear register                 Address offset: 0x82C */
  __IO uint32_t MP_S_APB4LPENSETR;   /*!< RCC secure APB4 sleep peripheral enable set register       Address offset: 0x830 */
  __IO uint32_t MP_S_APB4LPENCLRR;   /*!< RCC secure APB4 sleep peripheral enable clear register     Address offset: 0x834 */
  __IO uint32_t MP_NS_APB4LPENSETR;  /*!< RCC non-secure APB4 sleep peripheral enable set register   Address offset: 0x838 */
  __IO uint32_t MP_NS_APB4LPENCLRR;  /*!< RCC non-secure APB4 sleep peripheral enable clear register Address offset: 0x83C */
  __IO uint32_t MP_APB5LPENSETR;     /*!< RCC APB5 Sleep clock enable set register                   Address offset: 0x840 */
  __IO uint32_t MP_APB5LPENCLRR;     /*!< RCC APB5 Sleep clock enable clear register                 Address offset: 0x844 */
  __IO uint32_t MP_APB6LPENSETR;     /*!< RCC APB6 sleep clock enable set register                   Address offset: 0x848 */
  __IO uint32_t MP_APB6LPENCLRR;     /*!< RCC APB6 sleep clock enable clear register                 Address offset: 0x84C */
  __IO uint32_t MP_AHB2LPENSETR;     /*!< RCC AHB2 Sleep clock enable set register                   Address offset: 0x850 */
  __IO uint32_t MP_AHB2LPENCLRR;     /*!< RCC AHB2 Sleep clock enable clear register                 Address offset: 0x854 */
