zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp135cxx_ca7.h
#define ADC_OFR2_OFFSET2_EN_Pos           (31U)
#define ADC_OFR2_OFFSET2_EN_Msk           (0x1UL << ADC_OFR2_OFFSET2_EN_Pos)    /*!< 0x80000000 */
#define ADC_OFR2_OFFSET2_EN               ADC_OFR2_OFFSET2_EN_Msk              /*!< Offset y enable */

/********************  Bit definition for ADC_OFR3 register  ********************/
#define ADC_OFR3_OFFSET3_Pos              (0U)
#define ADC_OFR3_OFFSET3_Msk              (0xFFFUL << ADC_OFR3_OFFSET3_Pos)     /*!< 0x00000FFF */
#define ADC_OFR3_OFFSET3                  ADC_OFR3_OFFSET3_Msk                 /*!< Data offset y for the channel programmed into bits OFFSETy_CH[4:0] */
#define ADC_OFR3_OFFSET3_0                (0x1UL << ADC_OFR3_OFFSET3_Pos)       /*!< 0x00000001 */
#define ADC_OFR3_OFFSET3_1                (0x2UL << ADC_OFR3_OFFSET3_Pos)       /*!< 0x00000002 */
#define ADC_OFR3_OFFSET3_2                (0x4UL << ADC_OFR3_OFFSET3_Pos)       /*!< 0x00000004 */
#define ADC_OFR3_OFFSET3_3                (0x8UL << ADC_OFR3_OFFSET3_Pos)       /*!< 0x00000008 */
#define ADC_OFR3_OFFSET3_4                (0x10UL << ADC_OFR3_OFFSET3_Pos)      /*!< 0x00000010 */
#define ADC_OFR3_OFFSET3_5                (0x20UL << ADC_OFR3_OFFSET3_Pos)      /*!< 0x00000020 */
#define ADC_OFR3_OFFSET3_6                (0x40UL << ADC_OFR3_OFFSET3_Pos)      /*!< 0x00000040 */
#define ADC_OFR3_OFFSET3_7                (0x80UL << ADC_OFR3_OFFSET3_Pos)      /*!< 0x00000080 */
#define ADC_OFR3_OFFSET3_8                (0x100UL << ADC_OFR3_OFFSET3_Pos)     /*!< 0x00000100 */
#define ADC_OFR3_OFFSET3_9                (0x200UL << ADC_OFR3_OFFSET3_Pos)     /*!< 0x00000200 */
#define ADC_OFR3_OFFSET3_10               (0x400UL << ADC_OFR3_OFFSET3_Pos)     /*!< 0x00000400 */
#define ADC_OFR3_OFFSET3_11               (0x800UL << ADC_OFR3_OFFSET3_Pos)     /*!< 0x00000800 */

#define ADC_OFR3_OFFSETPOS_Pos            (24U)
#define ADC_OFR3_OFFSETPOS_Msk            (0x1UL << ADC_OFR3_OFFSETPOS_Pos)     /*!< 0x01000000 */
#define ADC_OFR3_OFFSETPOS                ADC_OFR3_OFFSETPOS_Msk               /*!< Positive offset */

#define ADC_OFR3_SATEN_Pos                (25U)
#define ADC_OFR3_SATEN_Msk                (0x1UL << ADC_OFR3_SATEN_Pos)         /*!< 0x02000000 */
#define ADC_OFR3_SATEN                    ADC_OFR3_SATEN_Msk                   /*!< Saturation enable */

#define ADC_OFR3_OFFSET3_CH_Pos           (26U)
#define ADC_OFR3_OFFSET3_CH_Msk           (0x1FUL << ADC_OFR3_OFFSET3_CH_Pos)   /*!< 0x7C000000 */
#define ADC_OFR3_OFFSET3_CH               ADC_OFR3_OFFSET3_CH_Msk              /*!< Channel selection for the data offset y */
#define ADC_OFR3_OFFSET3_CH_0             (0x1UL << ADC_OFR3_OFFSET3_CH_Pos)    /*!< 0x04000000 */
#define ADC_OFR3_OFFSET3_CH_1             (0x2UL << ADC_OFR3_OFFSET3_CH_Pos)    /*!< 0x08000000 */
#define ADC_OFR3_OFFSET3_CH_2             (0x4UL << ADC_OFR3_OFFSET3_CH_Pos)    /*!< 0x10000000 */
#define ADC_OFR3_OFFSET3_CH_3             (0x8UL << ADC_OFR3_OFFSET3_CH_Pos)    /*!< 0x20000000 */
#define ADC_OFR3_OFFSET3_CH_4             (0x10UL << ADC_OFR3_OFFSET3_CH_Pos)   /*!< 0x40000000 */

#define ADC_OFR3_OFFSET3_EN_Pos           (31U)
#define ADC_OFR3_OFFSET3_EN_Msk           (0x1UL << ADC_OFR3_OFFSET3_EN_Pos)    /*!< 0x80000000 */
#define ADC_OFR3_OFFSET3_EN               ADC_OFR3_OFFSET3_EN_Msk              /*!< Offset y enable */

/********************  Bit definition for ADC_OFR4 register  ********************/
#define ADC_OFR4_OFFSET4_Pos              (0U)
#define ADC_OFR4_OFFSET4_Msk              (0xFFFUL << ADC_OFR4_OFFSET4_Pos)     /*!< 0x00000FFF */
#define ADC_OFR4_OFFSET4                  ADC_OFR4_OFFSET4_Msk                 /*!< Data offset y for the channel programmed into bits OFFSETy_CH[4:0] */
#define ADC_OFR4_OFFSET4_0                (0x1UL << ADC_OFR4_OFFSET4_Pos)       /*!< 0x00000001 */
#define ADC_OFR4_OFFSET4_1                (0x2UL << ADC_OFR4_OFFSET4_Pos)       /*!< 0x00000002 */
#define ADC_OFR4_OFFSET4_2                (0x4UL << ADC_OFR4_OFFSET4_Pos)       /*!< 0x00000004 */
#define ADC_OFR4_OFFSET4_3                (0x8UL << ADC_OFR4_OFFSET4_Pos)       /*!< 0x00000008 */
#define ADC_OFR4_OFFSET4_4                (0x10UL << ADC_OFR4_OFFSET4_Pos)      /*!< 0x00000010 */
#define ADC_OFR4_OFFSET4_5                (0x20UL << ADC_OFR4_OFFSET4_Pos)      /*!< 0x00000020 */
#define ADC_OFR4_OFFSET4_6                (0x40UL << ADC_OFR4_OFFSET4_Pos)      /*!< 0x00000040 */
#define ADC_OFR4_OFFSET4_7                (0x80UL << ADC_OFR4_OFFSET4_Pos)      /*!< 0x00000080 */
#define ADC_OFR4_OFFSET4_8                (0x100UL << ADC_OFR4_OFFSET4_Pos)     /*!< 0x00000100 */
#define ADC_OFR4_OFFSET4_9                (0x200UL << ADC_OFR4_OFFSET4_Pos)     /*!< 0x00000200 */
#define ADC_OFR4_OFFSET4_10               (0x400UL << ADC_OFR4_OFFSET4_Pos)     /*!< 0x00000400 */
#define ADC_OFR4_OFFSET4_11               (0x800UL << ADC_OFR4_OFFSET4_Pos)     /*!< 0x00000800 */

#define ADC_OFR4_OFFSETPOS_Pos            (24U)
#define ADC_OFR4_OFFSETPOS_Msk            (0x1UL << ADC_OFR4_OFFSETPOS_Pos)     /*!< 0x01000000 */
#define ADC_OFR4_OFFSETPOS                ADC_OFR4_OFFSETPOS_Msk               /*!< Positive offset */

#define ADC_OFR4_SATEN_Pos                (25U)
#define ADC_OFR4_SATEN_Msk                (0x1UL << ADC_OFR4_SATEN_Pos)         /*!< 0x02000000 */
#define ADC_OFR4_SATEN                    ADC_OFR4_SATEN_Msk                   /*!< Saturation enable */

#define ADC_OFR4_OFFSET4_CH_Pos           (26U)
#define ADC_OFR4_OFFSET4_CH_Msk           (0x1FUL << ADC_OFR4_OFFSET4_CH_Pos)   /*!< 0x7C000000 */
#define ADC_OFR4_OFFSET4_CH               ADC_OFR4_OFFSET4_CH_Msk              /*!< Channel selection for the data offset y */
#define ADC_OFR4_OFFSET4_CH_0             (0x1UL << ADC_OFR4_OFFSET4_CH_Pos)    /*!< 0x04000000 */
#define ADC_OFR4_OFFSET4_CH_1             (0x2UL << ADC_OFR4_OFFSET4_CH_Pos)    /*!< 0x08000000 */
#define ADC_OFR4_OFFSET4_CH_2             (0x4UL << ADC_OFR4_OFFSET4_CH_Pos)    /*!< 0x10000000 */
#define ADC_OFR4_OFFSET4_CH_3             (0x8UL << ADC_OFR4_OFFSET4_CH_Pos)    /*!< 0x20000000 */
#define ADC_OFR4_OFFSET4_CH_4             (0x10UL << ADC_OFR4_OFFSET4_CH_Pos)   /*!< 0x40000000 */

#define ADC_OFR4_OFFSET4_EN_Pos           (31U)
#define ADC_OFR4_OFFSET4_EN_Msk           (0x1UL << ADC_OFR4_OFFSET4_EN_Pos)    /*!< 0x80000000 */
#define ADC_OFR4_OFFSET4_EN               ADC_OFR4_OFFSET4_EN_Msk              /*!< Offset y enable */

/********************  Bit definition for ADC_JDR1 register  ********************/
#define ADC_JDR1_JDATA_Pos                (0U)
#define ADC_JDR1_JDATA_Msk                (0xFFFFUL << ADC_JDR1_JDATA_Pos)      /*!< 0x0000FFFF */
#define ADC_JDR1_JDATA                    ADC_JDR1_JDATA_Msk                   /*!< ADC Injected DATA */
#define ADC_JDR1_JDATA_0                  (0x0001UL << ADC_JDR1_JDATA_Pos)      /*!< 0x00000001 */
#define ADC_JDR1_JDATA_1                  (0x0002UL << ADC_JDR1_JDATA_Pos)      /*!< 0x00000002 */
#define ADC_JDR1_JDATA_2                  (0x0004UL << ADC_JDR1_JDATA_Pos)      /*!< 0x00000004 */
#define ADC_JDR1_JDATA_3                  (0x0008UL << ADC_JDR1_JDATA_Pos)      /*!< 0x00000008 */
#define ADC_JDR1_JDATA_4                  (0x0010UL << ADC_JDR1_JDATA_Pos)      /*!< 0x00000010 */
#define ADC_JDR1_JDATA_5                  (0x0020UL << ADC_JDR1_JDATA_Pos)      /*!< 0x00000020 */
#define ADC_JDR1_JDATA_6                  (0x0040UL << ADC_JDR1_JDATA_Pos)      /*!< 0x00000040 */
#define ADC_JDR1_JDATA_7                  (0x0080UL << ADC_JDR1_JDATA_Pos)      /*!< 0x00000080 */
#define ADC_JDR1_JDATA_8                  (0x0100UL << ADC_JDR1_JDATA_Pos)      /*!< 0x00000100 */
#define ADC_JDR1_JDATA_9                  (0x0200UL << ADC_JDR1_JDATA_Pos)      /*!< 0x00000200 */
#define ADC_JDR1_JDATA_10                 (0x0400UL << ADC_JDR1_JDATA_Pos)      /*!< 0x00000400 */
#define ADC_JDR1_JDATA_11                 (0x0800UL << ADC_JDR1_JDATA_Pos)      /*!< 0x00000800 */
#define ADC_JDR1_JDATA_12                 (0x1000UL << ADC_JDR1_JDATA_Pos)      /*!< 0x00001000 */
#define ADC_JDR1_JDATA_13                 (0x2000UL << ADC_JDR1_JDATA_Pos)      /*!< 0x00002000 */
#define ADC_JDR1_JDATA_14                 (0x4000UL << ADC_JDR1_JDATA_Pos)      /*!< 0x00004000 */
#define ADC_JDR1_JDATA_15                 (0x8000UL << ADC_JDR1_JDATA_Pos)      /*!< 0x00008000 */

