zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp135cxx_ca7.h
/* Bit fields for LTDC_LxBLCR register */
#define LTDC_LxBLCR_BL_Pos               (0U)
#define LTDC_LxBLCR_BL_Msk               (0xffUL << LTDC_LxBLCR_BL_Pos)
#define LTDC_LxBLCR_BL                   LTDC_LxBLCR_BL_Msk  /*!< burst length- 0x00: maximum burst length (16 words 64bit, thus 128 Bytes)- 0x01: 1 word (of 64bit) per burst..- 0x10: 16 words (of 64bit) per burst- 0x11: reserved...- 0xFF: reserved. */

/* Bit fields for LTDC_LxPCR register */
#define LTDC_LxPCR_VPDEN_Pos             (1U)
#define LTDC_LxPCR_VPDEN_Msk             (0x1UL << LTDC_LxPCR_VPDEN_Pos)
#define LTDC_LxPCR_VPDEN                 LTDC_LxPCR_VPDEN_Msk  /*!< Vertical Pixel Duplication EnableAllows to read a picture, and double its height by duplication of its pixels.- 0: vertical duplication disabled.- 1: vertical duplication enabled. */
#define LTDC_LxPCR_HPDEN_Pos             (2U)
#define LTDC_LxPCR_HPDEN_Msk             (0x1UL << LTDC_LxPCR_HPDEN_Pos)
#define LTDC_LxPCR_HPDEN                 LTDC_LxPCR_HPDEN_Msk  /*!< Horizontal Pixel Duplication Enable.Allows to read a picture, and double its width by duplication of its pixels.- 0: horizontal duplication disabled.- 1: horizontal duplication enabled. */
#define LTDC_LxPCR_YCEN_Pos              (3U)
#define LTDC_LxPCR_YCEN_Msk              (0x1UL << LTDC_LxPCR_YCEN_Pos)
#define LTDC_LxPCR_YCEN                  LTDC_LxPCR_YCEN_Msk  /*!< YCbCr-to-RGB Conversion Enable:- 0: conversion disabled.- 1: YCbCr conversion enabled, using the YCM setting above. */
#define LTDC_LxPCR_YCM_Pos               (4U)
#define LTDC_LxPCR_YCM_Msk               (0x3UL << LTDC_LxPCR_YCM_Pos)
#define LTDC_LxPCR_YCM                   LTDC_LxPCR_YCM_Msk  /*!< YCbCr Conversion ModeDefined the type of input that is considered and converted to a YCbCr 444:- 00: interleaved 422 (Cb and Cr component are replicated horizontally for pixels P and P+1)- 01: semi-Planar 420: (Cb and Cr component are replicated horizontally and vertically. The layer main configuration defines the access to the Y buffer, and auxiliary registers define the access to the Cb and Cr buffers).- 10: full-Planar 420: (Cb and Cr component are replicated horizontally and vertically. The layer main configuration defines the access to the Y buffer, and auxiliary registers define the access to the Cb and Cr buffers).- 11: reserved. */
#define LTDC_LxPCR_YF_Pos                (6U)
#define LTDC_LxPCR_YF_Msk                (0x1UL << LTDC_LxPCR_YF_Pos)
#define LTDC_LxPCR_YF                    LTDC_LxPCR_YF_Msk  /*!< Y Component FirstDefines if the byte 0 of a word (in LSB) contains the Y component.- 0: Y component disabled (thus Cr or Cb component is on byte 0)- 1: Y component enabled (thus Y component is on byte 0) */
#define LTDC_LxPCR_CBF_Pos               (7U)
#define LTDC_LxPCR_CBF_Msk               (0x1UL << LTDC_LxPCR_CBF_Pos)
#define LTDC_LxPCR_CBF                   LTDC_LxPCR_CBF_Msk  /*!< Cb Component FirstDefines if the byte 0&amp;1 of a word (in LSB) contains the Cb component. The setting impacts only for interleaved and semi-planar modes, as it has no meaning in full-planar mode)- 0: Cb disabled (thus Cr component is on byte 0&amp;1)- 1: Cb enabled (thus Cb component is on byte 0&amp;1) */
#define LTDC_LxPCR_OF_Pos                (8U)
#define LTDC_LxPCR_OF_Msk                (0x1UL << LTDC_LxPCR_OF_Pos)
#define LTDC_LxPCR_OF                    LTDC_LxPCR_OF_Msk  /*!< Odd Pixel FirstDefines if the byte 0 of a word (in LSB) contains the Odd pixel.- 0: odd pixel disabled (thus even pixel on byte 0)- 1: odd pixel enabled (thus odd pixel on byte 0) */
#define LTDC_LxPCR_YREN_Pos              (9U)
#define LTDC_LxPCR_YREN_Msk              (0x1UL << LTDC_LxPCR_YREN_Pos)
#define LTDC_LxPCR_YREN                  LTDC_LxPCR_YREN_Msk  /*!< Y Rescale EnableWhen enabled, incoming Y values in range 16..235 are re-scaled to range 0..255, as required e.g. for ITU-R BT.601 conversion: For Y2R and Y2B values.- 0: rescaling disabled.- 1: rescaling enabled. */

/* Bit fields for LTDC_LxCFBAR register */
#define LTDC_LxCFBAR_CFBADD_Pos          (0U)
#define LTDC_LxCFBAR_CFBADD_Msk          (0xffffffffUL << LTDC_LxCFBAR_CFBADD_Pos)
#define LTDC_LxCFBAR_CFBADD              LTDC_LxCFBAR_CFBADD_Msk  /*!< color frame buffer start addressThese bits define the color frame buffer start address. */

/* Bit fields for LTDC_LxCFBLR register */
#define LTDC_LxCFBLR_CFBLL_Pos           (0U)
#define LTDC_LxCFBLR_CFBLL_Msk           (0xffffUL << LTDC_LxCFBLR_CFBLL_Pos)
#define LTDC_LxCFBLR_CFBLL               LTDC_LxCFBLR_CFBLL_Msk  /*!< color frame buffer line lengthThese bits define the length of one line of pixels in bytes + 7.The line length is computed as follows:active high width * number of bytes per pixel + 7. */
#define LTDC_LxCFBLR_CFBP_Pos            (16U)
#define LTDC_LxCFBLR_CFBP_Msk            (0xffffUL << LTDC_LxCFBLR_CFBP_Pos)
#define LTDC_LxCFBLR_CFBP                LTDC_LxCFBLR_CFBP_Msk  /*!< color frame buffer pitch in bytesThese bits define the pitch that is the increment from the start of one line of pixels to the start of the next line in bytes.Negative values (with msb bit = 1) are allowed, to read the buffer from bottom to top, and thus to flip is vertically. When vertically flipped, as the address register must provide the address of the first line to be read, the address register must point to the start of the bottom line of the buffer. */

/* Bit fields for LTDC_LxCFBLNR register */
#define LTDC_LxCFBLNR_CFBLNBR_Pos        (0U)
#define LTDC_LxCFBLNR_CFBLNBR_Msk        (0xffffUL << LTDC_LxCFBLNR_CFBLNBR_Pos)
#define LTDC_LxCFBLNR_CFBLNBR            LTDC_LxCFBLNR_CFBLNBR_Msk  /*!< frame buffer line numberThese bits define the number of lines in the frame buffer that corresponds to the active high width. */

/* Bit fields for LTDC_LxAFBA0R register */
#define LTDC_LxAFBA0R_AFBADD0_Pos        (0U)
#define LTDC_LxAFBA0R_AFBADD0_Msk        (0xffffffffUL << LTDC_LxAFBA0R_AFBADD0_Pos)
#define LTDC_LxAFBA0R_AFBADD0            LTDC_LxAFBA0R_AFBADD0_Msk  /*!< color frame buffer start addressThese bits define the color frame buffer start address. */

/* Bit fields for LTDC_LxAFBA1R register */
#define LTDC_LxAFBA1R_AFBADD1_Pos        (0U)
#define LTDC_LxAFBA1R_AFBADD1_Msk        (0xffffffffUL << LTDC_LxAFBA1R_AFBADD1_Pos)
#define LTDC_LxAFBA1R_AFBADD1            LTDC_LxAFBA1R_AFBADD1_Msk  /*!< color frame buffer start addressThese bits define the color frame buffer start address. */

/* Bit fields for LTDC_LxAFBLR register */
#define LTDC_LxAFBLR_AFBLL_Pos           (0U)
#define LTDC_LxAFBLR_AFBLL_Msk           (0xffffUL << LTDC_LxAFBLR_AFBLL_Pos)
#define LTDC_LxAFBLR_AFBLL               LTDC_LxAFBLR_AFBLL_Msk  /*!< color frame buffer line lengthThese bits define the length of one line of pixels in bytes + 7.The line length is computed as follows:active high width * number of bytes per pixel + 7. */
#define LTDC_LxAFBLR_AFBP_Pos            (16U)
#define LTDC_LxAFBLR_AFBP_Msk            (0xffffUL << LTDC_LxAFBLR_AFBP_Pos)
#define LTDC_LxAFBLR_AFBP                LTDC_LxAFBLR_AFBP_Msk  /*!< color frame buffer pitch in bytesThese bits define the pitch that is the increment from the start of one line of pixels to the start of the next line in bytes.Negative values (with msb bit = 1) are allowed, to read the buffer from bottom to top, and thus to flip is vertically. When vertically flipped, as the address register must provide the address of the first line to be read, the address register must point to the start of the bottom line of the buffer. */

/* Bit fields for LTDC_LxAFBLNR register */
#define LTDC_LxAFBLNR_AFBLNBR_Pos        (0U)
#define LTDC_LxAFBLNR_AFBLNBR_Msk        (0xffffUL << LTDC_LxAFBLNR_AFBLNBR_Pos)
#define LTDC_LxAFBLNR_AFBLNBR            LTDC_LxAFBLNR_AFBLNBR_Msk  /*!< frame buffer line numberThese bits define the number of lines in the frame buffer that corresponds to the active high width. */

/* Bit fields for LTDC_LxCLUTWR register */
#define LTDC_LxCLUTWR_BLUE_Pos           (0U)
#define LTDC_LxCLUTWR_BLUE_Msk           (0xffUL << LTDC_LxCLUTWR_BLUE_Pos)
#define LTDC_LxCLUTWR_BLUE               LTDC_LxCLUTWR_BLUE_Msk  /*!< blue valueThese bits configure the blue value. */
#define LTDC_LxCLUTWR_GREEN_Pos          (8U)
#define LTDC_LxCLUTWR_GREEN_Msk          (0xffUL << LTDC_LxCLUTWR_GREEN_Pos)
#define LTDC_LxCLUTWR_GREEN              LTDC_LxCLUTWR_GREEN_Msk  /*!< green valueThese bits configure the green value. */
#define LTDC_LxCLUTWR_RED_Pos            (16U)
#define LTDC_LxCLUTWR_RED_Msk            (0xffUL << LTDC_LxCLUTWR_RED_Pos)
#define LTDC_LxCLUTWR_RED                LTDC_LxCLUTWR_RED_Msk  /*!< red valueThese bits configure the red value. */
#define LTDC_LxCLUTWR_CLUTADD_Pos        (24U)
#define LTDC_LxCLUTWR_CLUTADD_Msk        (0xffUL << LTDC_LxCLUTWR_CLUTADD_Pos)
#define LTDC_LxCLUTWR_CLUTADD            LTDC_LxCLUTWR_CLUTADD_Msk  /*!< CLUT addressThese bits configure the CLUT address (color position within the CLUT) of each RGB value. */

/* Bit fields for LTDC_LxCYR0R register */
#define LTDC_LxCYR0R_CR2R_Pos            (0U)
#define LTDC_LxCYR0R_CR2R_Msk            (0x3ffUL << LTDC_LxCYR0R_CR2R_Pos)
#define LTDC_LxCYR0R_CR2R                LTDC_LxCYR0R_CR2R_Msk  /*!< Cr-to-Red coefficient, with bits 9:8 as positive integer and 7:0 as decimals. */
#define LTDC_LxCYR0R_CB2B_Pos            (16U)
#define LTDC_LxCYR0R_CB2B_Msk            (0x3ffUL << LTDC_LxCYR0R_CB2B_Pos)
#define LTDC_LxCYR0R_CB2B                LTDC_LxCYR0R_CB2B_Msk  /*!< Cb-to-Blue coefficient, with bits 9:8 as positive integer and 7:0 as decimals. */

/* Bit fields for LTDC_LxCYR1R register */
#define LTDC_LxCYR1R_CR2G_Pos            (0U)
#define LTDC_LxCYR1R_CR2G_Msk            (0x3ffUL << LTDC_LxCYR1R_CR2G_Pos)
#define LTDC_LxCYR1R_CR2G                LTDC_LxCYR1R_CR2G_Msk  /*!< Cr-to-Green coefficient, with bits 9:8 as positive integer and 7:0 as decimals. */
#define LTDC_LxCYR1R_CB2G_Pos            (16U)
#define LTDC_LxCYR1R_CB2G_Msk            (0x3ffUL << LTDC_LxCYR1R_CB2G_Pos)
#define LTDC_LxCYR1R_CB2G                LTDC_LxCYR1R_CB2G_Msk  /*!< Cb-to-Green coefficient, with bits 9:8 as positive integer and 7:0 as decimals. */

/******************************************************************************/
/*                                                                            */
/*                       Public Key Accelerator (PKA)                         */
/*                       refer to PKA2 v1.0 data-sheet                       */
/*                                                                            */
/******************************************************************************/
#define PKA_VERSION_V2_0              (1U)                                 /*!< i.e. MP2 uses PKA version v2.0 */

