zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp135cxx_ca7.h
/********************  Bit definition for PWR_VER register  ********************/
#define PWR_VER_MAJREV_Pos             (4U)
#define PWR_VER_MAJREV_Msk             (0xFUL << PWR_VER_MAJREV_Pos)            /*!< 0x000000F0 */
#define PWR_VER_MAJREV                 PWR_VER_MAJREV_Msk                      /*!< Major Revision number */
#define PWR_VER_MINREV_Pos             (0U)
#define PWR_VER_MINREV_Msk             (0xFUL << PWR_VER_MINREV_Pos)            /*!< 0x0000000F */
#define PWR_VER_MINREV                 PWR_VER_MINREV_Msk                      /*!< Minor Revision number */

/********************  Bit definition for PWR_ID register  ********************/
#define PWR_ID_IPID_Pos                (0U)
#define PWR_ID_IPID_Msk                (0xFFFFFFFFUL << PWR_ID_IPID_Pos)        /*!< 0xFFFFFFFF */
#define PWR_ID_IPID                    PWR_ID_IPID_Msk                         /*!< IP identification */

/********************  Bit definition for PWR_SID register  ********************/
#define PWR_SID_SID_Pos                (0U)
#define PWR_SID_SID_Msk                (0xFFFFFFFFUL << PWR_SID_SID_Pos)        /*!< 0xFFFFFFFF */
#define PWR_SID_SID                    PWR_SID_SID_Msk                         /*!< Size identification */


/******************************************************************************/
/*                                                                            */
/*                   Boot and Security and OTP Control (BSEC)                 */
/*                                                                            */
/******************************************************************************/
/******************  Bit definition for BSEC_OTP_CONFIG register  *****************/
#define BSEC_OTP_CONFIG_PWRUP_Pos          (0U)
#define BSEC_OTP_CONFIG_PWRUP_Msk          (0x1UL << BSEC_OTP_CONFIG_PWRUP_Pos) /*!< 0x00000001 */
#define BSEC_OTP_CONFIG_PWRUP              BSEC_OTP_CONFIG_PWRUP_Msk           /*!< OTP power-up control */
#define BSEC_OTP_CONFIG_FRC_Pos            (1U)
#define BSEC_OTP_CONFIG_FRC_Msk            (0x3UL << BSEC_OTP_CONFIG_FRC_Pos)   /*!< 0x00000006 */
#define BSEC_OTP_CONFIG_FRC                BSEC_OTP_CONFIG_FRC_Msk             /*!< OTP clock frequency range selection */
#define BSEC_OTP_CONFIG_FRC_0              (0x1UL << BSEC_OTP_CONFIG_FRC_Pos)   /*!< 0x00000002 */
#define BSEC_OTP_CONFIG_FRC_1              (0x2UL << BSEC_OTP_CONFIG_FRC_Pos)   /*!< 0x00000004 */
#define BSEC_OTP_CONFIG_PRGWIDTH_Pos       (3U)
#define BSEC_OTP_CONFIG_PRGWIDTH_Msk       (0xFUL << BSEC_OTP_CONFIG_PRGWIDTH_Pos) /*!< 0x00000078 */
#define BSEC_OTP_CONFIG_PRGWIDTH           BSEC_OTP_CONFIG_PRGWIDTH_Msk        /*!< OTP programming pulse width */
#define BSEC_OTP_CONFIG_PRGWIDTH_0         (0x1UL << BSEC_OTP_CONFIG_PRGWIDTH_Pos) /*!< 0x00000008 */
#define BSEC_OTP_CONFIG_PRGWIDTH_1         (0x2UL << BSEC_OTP_CONFIG_PRGWIDTH_Pos) /*!< 0x00000010 */
#define BSEC_OTP_CONFIG_PRGWIDTH_2         (0x4UL << BSEC_OTP_CONFIG_PRGWIDTH_Pos) /*!< 0x00000020 */
#define BSEC_OTP_CONFIG_PRGWIDTH_3         (0x8UL << BSEC_OTP_CONFIG_PRGWIDTH_Pos) /*!< 0x00000040 */
#define BSEC_OTP_CONFIG_TREAD_Pos          (7U)
#define BSEC_OTP_CONFIG_TREAD_Msk          (0x3UL << BSEC_OTP_CONFIG_TREAD_Pos) /*!< 0x00000180 */
#define BSEC_OTP_CONFIG_TREAD              BSEC_OTP_CONFIG_TREAD_Msk           /*!< set OTP reading current level */
#define BSEC_OTP_CONFIG_TREAD_0            (0x1UL << BSEC_OTP_CONFIG_TREAD_Pos) /*!< 0x00000080 */
#define BSEC_OTP_CONFIG_TREAD_1            (0x2UL << BSEC_OTP_CONFIG_TREAD_Pos) /*!< 0x00000100 */

/******************  Bit definition for BSEC_OTP_CONTROL register  ****************/
#define BSEC_OTP_CONTROL_ADDR_Pos          (0U)
#define BSEC_OTP_CONTROL_ADDR_Msk          (0x7FUL << BSEC_OTP_CONTROL_ADDR_Pos) /*!< 0x0000007F */
#define BSEC_OTP_CONTROL_ADDR              BSEC_OTP_CONTROL_ADDR_Msk           /*!< OTP word address */
#define BSEC_OTP_CONTROL_PROG_Pos          (8U)
#define BSEC_OTP_CONTROL_PROG_Msk          (0x1UL << BSEC_OTP_CONTROL_PROG_Pos) /*!< 0x00000100 */
#define BSEC_OTP_CONTROL_PROG              BSEC_OTP_CONTROL_PROG_Msk           /*!< OTP operation control */
#define BSEC_OTP_CONTROL_LOCK_Pos          (9U)
#define BSEC_OTP_CONTROL_LOCK_Msk          (0x1UL << BSEC_OTP_CONTROL_LOCK_Pos) /*!< 0x00000200 */
#define BSEC_OTP_CONTROL_LOCK              BSEC_OTP_CONTROL_LOCK_Msk           /*!< OTP permanent word lock control */

/******************  Bit definition for BSEC_OTP_STATUS register  *****************/
#define BSEC_OTP_STATUS_SECURE_Pos         (0U)
#define BSEC_OTP_STATUS_SECURE_Msk         (0x1UL << BSEC_OTP_STATUS_SECURE_Pos) /*!< 0x00000001 */
#define BSEC_OTP_STATUS_SECURE             BSEC_OTP_STATUS_SECURE_Msk          /*!< OTP secured mode */
#define BSEC_OTP_STATUS_FULLDBG_Pos        (1U)
#define BSEC_OTP_STATUS_FULLDBG_Msk        (0x1UL << BSEC_OTP_STATUS_FULLDBG_Pos) /*!< 0x00000002 */
#define BSEC_OTP_STATUS_FULLDBG            BSEC_OTP_STATUS_FULLDBG_Msk         /*!< OTP mode in full debug */
#define BSEC_OTP_STATUS_INVALID_Pos        (2U)
#define BSEC_OTP_STATUS_INVALID_Msk        (0x1UL << BSEC_OTP_STATUS_INVALID_Pos) /*!< 0x00000004 */
#define BSEC_OTP_STATUS_INVALID            BSEC_OTP_STATUS_INVALID_Msk         /*!< OTP invalid mode */
#define BSEC_OTP_STATUS_BUSY_Pos           (3U)
#define BSEC_OTP_STATUS_BUSY_Msk           (0x1UL << BSEC_OTP_STATUS_BUSY_Pos)  /*!< 0x00000008 */
#define BSEC_OTP_STATUS_BUSY               BSEC_OTP_STATUS_BUSY_Msk            /*!< OTP operation status */
#define BSEC_OTP_STATUS_PROGFAIL_Pos       (4U)
#define BSEC_OTP_STATUS_PROGFAIL_Msk       (0x1UL << BSEC_OTP_STATUS_PROGFAIL_Pos) /*!< 0x00000010 */
#define BSEC_OTP_STATUS_PROGFAIL           BSEC_OTP_STATUS_PROGFAIL_Msk        /*!< last programming status */
#define BSEC_OTP_STATUS_PWRON_Pos          (5U)
#define BSEC_OTP_STATUS_PWRON_Msk          (0x1UL << BSEC_OTP_STATUS_PWRON_Pos) /*!< 0x00000020 */
#define BSEC_OTP_STATUS_PWRON              BSEC_OTP_STATUS_PWRON_Msk           /*!< OTP power status */
#define BSEC_OTP_STATUS_BIST1LOCK_Pos      (6U)
#define BSEC_OTP_STATUS_BIST1LOCK_Msk      (0x1UL << BSEC_OTP_STATUS_BIST1LOCK_Pos) /*!< 0x00000040 */
#define BSEC_OTP_STATUS_BIST1LOCK          BSEC_OTP_STATUS_BIST1LOCK_Msk       /*!< BIST1 locked */
#define BSEC_OTP_STATUS_BIST2LOCK_Pos      (7U)
#define BSEC_OTP_STATUS_BIST2LOCK_Msk      (0x1UL << BSEC_OTP_STATUS_BIST2LOCK_Pos) /*!< 0x00000080 */
#define BSEC_OTP_STATUS_BIST2LOCK          BSEC_OTP_STATUS_BIST2LOCK_Msk       /*!< BIST2 locked */
#define BSEC_OTP_STATUS_CLOSED_Pos         (8U)
#define BSEC_OTP_STATUS_CLOSED_Msk         (0x1UL << BSEC_OTP_STATUS_CLOSED_Pos) /*!< 0x00000100 */
#define BSEC_OTP_STATUS_CLOSED             BSEC_OTP_STATUS_CLOSED_Msk       /*!<  OTP_SECURED mode */
#define BSEC_OTP_STATUS_BSCANDIS_Pos       (9U)
#define BSEC_OTP_STATUS_BSCANDIS_Msk       (0x1UL << BSEC_OTP_STATUS_BSCANDIS_Pos) /*!< 0x00000200 */
#define BSEC_OTP_STATUS_BSCANDIS           BSEC_OTP_STATUS_BSCANDIS_Msk       /*!<  Boundary Scan status */
#define BSEC_OTP_STATUS_JTAGDIS_Pos        (10U)
#define BSEC_OTP_STATUS_JTAGDIS_Msk        (0x1UL << BSEC_OTP_STATUS_JTAGDIS_Pos) /*!< 0x00000400 */
#define BSEC_OTP_STATUS_JTAGDIS            BSEC_OTP_STATUS_JTAGDIS_Msk       /*!<  TAG port status. If disable, only REV_ID information and JTAGIN are accessible */

/******************  Bit definition for BSEC_OTP_LOCK register  ********************/
#define BSEC_OTP_LOCK_OTP_Pos              (0U)
#define BSEC_OTP_LOCK_OTP_Msk              (0x1UL << BSEC_OTP_LOCK_OTP_Pos)     /*!< 0x00000001 */
#define BSEC_OTP_LOCK_OTP                  BSEC_OTP_LOCK_OTP_Msk               /*!< upper OTP read lock */
#define BSEC_OTP_LOCK_DENREG_Pos           (2U)
#define BSEC_OTP_LOCK_DENREG_Msk           (0x1UL << BSEC_OTP_LOCK_DENREG_Pos)  /*!< 0x00000004 */
#define BSEC_OTP_LOCK_DENREG               BSEC_OTP_LOCK_DENREG_Msk            /*!< debug enable register sticky lock */
#define BSEC_OTP_LOCK_FENREG_Pos           (3U)
#define BSEC_OTP_LOCK_FENREG_Msk           (0x1UL << BSEC_OTP_LOCK_FENREG_Pos)  /*!< 0x00000008 */
#define BSEC_OTP_LOCK_FENREG               BSEC_OTP_LOCK_FENREG_Msk            /*!< feature enable register sticky lock */
#define BSEC_OTP_LOCK_GPLOCK_Pos           (4U)
#define BSEC_OTP_LOCK_GPLOCK_Msk           (0x1UL << BSEC_OTP_LOCK_GPLOCK_Pos)  /*!< 0x00000010 */
#define BSEC_OTP_LOCK_GPLOCK               BSEC_OTP_LOCK_GPLOCK_Msk            /*!< programming sticky lock */

/********************  Bit definition for BSEC_DENABLE register********************/
#define BSEC_DENABLE_DFTEN_Pos             (0U)
#define BSEC_DENABLE_DFTEN_Msk             (0x1UL << BSEC_DENABLE_DFTEN_Pos)    /*!< 0x00000001 */
#define BSEC_DENABLE_DFTEN                 BSEC_DENABLE_DFTEN_Msk              /*!< DFT enable with signal dften */
#define BSEC_DENABLE_DBGEN_Pos             (1U)
#define BSEC_DENABLE_DBGEN_Msk             (0x1UL << BSEC_DENABLE_DBGEN_Pos)    /*!< 0x00000002 */
#define BSEC_DENABLE_DBGEN                 BSEC_DENABLE_DBGEN_Msk              /*!< debug enable with signal dbgen */
#define BSEC_DENABLE_NIDEN_Pos             (2U)
#define BSEC_DENABLE_NIDEN_Msk             (0x1UL << BSEC_DENABLE_NIDEN_Pos)    /*!< 0x00000004 */
#define BSEC_DENABLE_NIDEN                 BSEC_DENABLE_NIDEN_Msk              /*!< non-invasive debug enable with signal niden */
#define BSEC_DENABLE_DEVICEEN_Pos          (3U)
#define BSEC_DENABLE_DEVICEEN_Msk          (0x1UL << BSEC_DENABLE_DEVICEEN_Pos) /*!< 0x00000008 */
#define BSEC_DENABLE_DEVICEEN              BSEC_DENABLE_DEVICEEN_Msk           /*!< controls access to debug component via external debug port by signal deviceen */
#define BSEC_DENABLE_HDPEN_Pos             (4U)
#define BSEC_DENABLE_HDPEN_Msk             (0x1UL << BSEC_DENABLE_HDPEN_Pos)    /*!< 0x00000010 */
#define BSEC_DENABLE_HDPEN                 BSEC_DENABLE_HDPEN_Msk              /*!< hardware debug port enable with signal hdpen */
#define BSEC_DENABLE_SPIDEN_Pos            (5U)
#define BSEC_DENABLE_SPIDEN_Msk            (0x1UL << BSEC_DENABLE_SPIDEN_Pos)   /*!< 0x00000020 */
#define BSEC_DENABLE_SPIDEN                BSEC_DENABLE_SPIDEN_Msk             /*!< secure privilege invasive debug enable with signal spniden */
#define BSEC_DENABLE_SPNIDEN_Pos           (6U)
#define BSEC_DENABLE_SPNIDEN_Msk           (0x1UL << BSEC_DENABLE_SPNIDEN_Pos)  /*!< 0x00000040 */
#define BSEC_DENABLE_SPNIDEN               BSEC_DENABLE_SPNIDEN_Msk            /*!< secure privilege non-invasive debug enable with signal spiden */
#define BSEC_DENABLE_CP15SDISABLE_Pos      (7U)
#define BSEC_DENABLE_CP15SDISABLE_Msk      (0x3UL << BSEC_DENABLE_CP15SDISABLE_Pos) /*!< 0x00000180 */
#define BSEC_DENABLE_CP15SDISABLE          BSEC_DENABLE_CP15SDISABLE_Msk       /*!< write access to some secure Cortex®-A7 CP15 registers disable CPDISABLE[0] applies to CPU0. CPDISABLE[1] applies to CPU1 */
#define BSEC_DENABLE_CP15SDISABLE_0        (0x1UL << BSEC_DENABLE_CP15SDISABLE_Pos) /*!< 0x00000080 */
#define BSEC_DENABLE_CP15SDISABLE_1        (0x2UL << BSEC_DENABLE_CP15SDISABLE_Pos) /*!< 0x00000100 */
#define BSEC_DENABLE_CFGSDISABLE_Pos       (9U)
#define BSEC_DENABLE_CFGSDISABLE_Msk       (0x1UL << BSEC_DENABLE_CFGSDISABLE_Pos) /*!< 0x00000200 */
#define BSEC_DENABLE_CFGSDISABLE           BSEC_DENABLE_CFGSDISABLE_Msk        /*!< write access to secure GIC registers disable with signal cfgsdisable */
#define BSEC_DENABLE_DBGSWENABLE_Pos       (10U)
#define BSEC_DENABLE_DBGSWENABLE_Msk       (0x1UL << BSEC_DENABLE_DBGSWENABLE_Pos) /*!< 0x00000400 */
#define BSEC_DENABLE_DBGSWENABLE           BSEC_DENABLE_DBGSWENABLE_Msk        /*!< control self hosted debug enable with signal dbgswenable */

