zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp135cxx_ca7.h
/*****************  Bit definition for RCC_HSICFGR register  ******************/
#define RCC_HSICFGR_HSIDIV_Pos                     (0U)
#define RCC_HSICFGR_HSIDIV_Msk                     (0x3UL << RCC_HSICFGR_HSIDIV_Pos)                    /*!< 0x00000003 */
#define RCC_HSICFGR_HSIDIV                         RCC_HSICFGR_HSIDIV_Msk                              /*!< HSI clock divider Written by software. These bits allows the user to select a division ratio in order to select the wanted HSI clock frequency. The bit HSIDIVRDY of (RCC_OCRDYR) indicates when the new division ratio is taken into account. */
#define RCC_HSICFGR_HSIDIV_0                       (0x1UL << RCC_HSICFGR_HSIDIV_Pos)                    /*!< 0x00000001 */
#define RCC_HSICFGR_HSIDIV_1                       (0x2UL << RCC_HSICFGR_HSIDIV_Pos)                    /*!< 0x00000002 */
#define RCC_HSICFGR_HSITRIM_Pos                    (8U)
#define RCC_HSICFGR_HSITRIM_Msk                    (0x7FUL << RCC_HSICFGR_HSITRIM_Pos)                  /*!< 0x00007F00 */
#define RCC_HSICFGR_HSITRIM                        RCC_HSICFGR_HSITRIM_Msk                             /*!< HSI clock trimming Set by software to adjust calibration. HSITRIM represents a signed value. HSITRIM field is added to the engineering Option Bytes loaded during reset phase (bsec_hsi_cal[11:0]) in order to form the calibration trimming value. HSICAL[11:0] = HSITRIM[6:0] + bsec_hsi_cal[11:0]. ... ... */
#define RCC_HSICFGR_HSITRIM_0                      (0x1UL << RCC_HSICFGR_HSITRIM_Pos)                 /*!< 0x00000100 */
#define RCC_HSICFGR_HSITRIM_1                      (0x2UL << RCC_HSICFGR_HSITRIM_Pos)                 /*!< 0x00000200 */
#define RCC_HSICFGR_HSITRIM_2                      (0x4UL << RCC_HSICFGR_HSITRIM_Pos)                 /*!< 0x00000400 */
#define RCC_HSICFGR_HSITRIM_3                      (0x8UL << RCC_HSICFGR_HSITRIM_Pos)                 /*!< 0x00000800 */
#define RCC_HSICFGR_HSITRIM_4                      (0x10UL << RCC_HSICFGR_HSITRIM_Pos)                /*!< 0x00001000 */
#define RCC_HSICFGR_HSITRIM_5                      (0x20UL << RCC_HSICFGR_HSITRIM_Pos)                /*!< 0x00002000 */
#define RCC_HSICFGR_HSITRIM_6                      (0x40UL << RCC_HSICFGR_HSITRIM_Pos)                /*!< 0x00004000 */
#define RCC_HSICFGR_HSICAL_Pos                     (16U)
#define RCC_HSICFGR_HSICAL_Msk                     (0xFFFUL << RCC_HSICFGR_HSICAL_Pos)                  /*!< 0x0FFF0000 */
#define RCC_HSICFGR_HSICAL                         RCC_HSICFGR_HSICAL_Msk                              /*!< HSI clock calibration Set by hardware by option byte loading during system reset Adjusted by software through trimming bits HSITRIM. This field represents the sum of engineering Option Byte calibration value and HSITRIM bits value. */
#define RCC_HSICFGR_HSICAL_0                       (0x1UL << RCC_HSICFGR_HSICAL_Pos)                /*!< 0x00010000 */
#define RCC_HSICFGR_HSICAL_1                       (0x2UL << RCC_HSICFGR_HSICAL_Pos)                /*!< 0x00020000 */
#define RCC_HSICFGR_HSICAL_2                       (0x4UL << RCC_HSICFGR_HSICAL_Pos)                /*!< 0x00040000 */
#define RCC_HSICFGR_HSICAL_3                       (0x8UL << RCC_HSICFGR_HSICAL_Pos)                /*!< 0x00080000 */
#define RCC_HSICFGR_HSICAL_4                       (0x10UL << RCC_HSICFGR_HSICAL_Pos)               /*!< 0x00100000 */
#define RCC_HSICFGR_HSICAL_5                       (0x20UL << RCC_HSICFGR_HSICAL_Pos)               /*!< 0x00200000 */
#define RCC_HSICFGR_HSICAL_6                       (0x40UL << RCC_HSICFGR_HSICAL_Pos)               /*!< 0x00400000 */
#define RCC_HSICFGR_HSICAL_7                       (0x80UL << RCC_HSICFGR_HSICAL_Pos)               /*!< 0x00800000 */
#define RCC_HSICFGR_HSICAL_8                       (0x100UL << RCC_HSICFGR_HSICAL_Pos)              /*!< 0x01000000 */
#define RCC_HSICFGR_HSICAL_9                       (0x200UL << RCC_HSICFGR_HSICAL_Pos)              /*!< 0x02000000 */
#define RCC_HSICFGR_HSICAL_10                      (0x400UL << RCC_HSICFGR_HSICAL_Pos)              /*!< 0x04000000 */
#define RCC_HSICFGR_HSICAL_11                      (0x800UL << RCC_HSICFGR_HSICAL_Pos)              /*!< 0x08000000 */

/*****************  Bit definition for RCC_CSICFGR register  ******************/
#define RCC_CSICFGR_CSITRIM_Pos                    (8U)
#define RCC_CSICFGR_CSITRIM_Msk                    (0x1FUL << RCC_CSICFGR_CSITRIM_Pos)                  /*!< 0x00001F00 */
#define RCC_CSICFGR_CSITRIM                        RCC_CSICFGR_CSITRIM_Msk                             /*!< CSI clock trimming Set by software to adjust calibration. CSITRIM field is added to the engineering Option Bytes loaded during reset phase (bsec_csi_cal[7:0]) in order to form the calibration trimming value. CSICAL[7:0] = CSITRIM[4:0] + bsec_csi_cal[7:0]. */
#define RCC_CSICFGR_CSITRIM_0                      (0x1UL << RCC_CSICFGR_CSITRIM_Pos)                 /*!< 0x00000100 */
#define RCC_CSICFGR_CSITRIM_1                      (0x2UL << RCC_CSICFGR_CSITRIM_Pos)                 /*!< 0x00000200 */
#define RCC_CSICFGR_CSITRIM_2                      (0x4UL << RCC_CSICFGR_CSITRIM_Pos)                 /*!< 0x00000400 */
#define RCC_CSICFGR_CSITRIM_3                      (0x8UL << RCC_CSICFGR_CSITRIM_Pos)                 /*!< 0x00000800 */
#define RCC_CSICFGR_CSITRIM_4                      (0x10UL << RCC_CSICFGR_CSITRIM_Pos)                /*!< 0x00001000 */
#define RCC_CSICFGR_CSICAL_Pos                     (16U)
#define RCC_CSICFGR_CSICAL_Msk                     (0xFFUL << RCC_CSICFGR_CSICAL_Pos)                   /*!< 0x00FF0000 */
#define RCC_CSICFGR_CSICAL                         RCC_CSICFGR_CSICAL_Msk                              /*!< CSI clock calibration Set by hardware by option byte loading during system reset. Adjusted by software through trimming bits CSITRIM. This field represents the sum of engineering Option Byte calibration value and CSITRIM bits value */
#define RCC_CSICFGR_CSICAL_0                       (0x1UL << RCC_CSICFGR_CSICAL_Pos)                /*!< 0x00010000 */
#define RCC_CSICFGR_CSICAL_1                       (0x2UL << RCC_CSICFGR_CSICAL_Pos)                /*!< 0x00020000 */
#define RCC_CSICFGR_CSICAL_2                       (0x4UL << RCC_CSICFGR_CSICAL_Pos)                /*!< 0x00040000 */
#define RCC_CSICFGR_CSICAL_3                       (0x8UL << RCC_CSICFGR_CSICAL_Pos)                /*!< 0x00080000 */
#define RCC_CSICFGR_CSICAL_4                       (0x10UL << RCC_CSICFGR_CSICAL_Pos)               /*!< 0x00100000 */
#define RCC_CSICFGR_CSICAL_5                       (0x20UL << RCC_CSICFGR_CSICAL_Pos)               /*!< 0x00200000 */
#define RCC_CSICFGR_CSICAL_6                       (0x40UL << RCC_CSICFGR_CSICAL_Pos)               /*!< 0x00400000 */
#define RCC_CSICFGR_CSICAL_7                       (0x80UL << RCC_CSICFGR_CSICAL_Pos)               /*!< 0x00800000 */

/*****************  Bit definition for RCC_MCO1CFGR register  *****************/
#define RCC_MCO1CFGR_MCO1SEL_Pos                   (0U)
#define RCC_MCO1CFGR_MCO1SEL_Msk                   (0x7UL << RCC_MCO1CFGR_MCO1SEL_Pos)                  /*!< 0x00000007 */
#define RCC_MCO1CFGR_MCO1SEL                       RCC_MCO1CFGR_MCO1SEL_Msk                            /*!< MCO1 clock output selection Set and cleared by software. Clock source selection may generate glitches on MCO1. It is highly recommended to configure these bits only after reset, before enabling the external oscillators and the PLLs. others: reserved */
#define RCC_MCO1CFGR_MCO1SEL_0                     (0x1UL << RCC_MCO1CFGR_MCO1SEL_Pos)                  /*!< 0x00000001 */
#define RCC_MCO1CFGR_MCO1SEL_1                     (0x2UL << RCC_MCO1CFGR_MCO1SEL_Pos)                  /*!< 0x00000002 */
#define RCC_MCO1CFGR_MCO1SEL_2                     (0x4UL << RCC_MCO1CFGR_MCO1SEL_Pos)                  /*!< 0x00000004 */
#define RCC_MCO1CFGR_MCO1DIV_Pos                   (4U)
#define RCC_MCO1CFGR_MCO1DIV_Msk                   (0xFUL << RCC_MCO1CFGR_MCO1DIV_Pos)                  /*!< 0x000000F0 */
#define RCC_MCO1CFGR_MCO1DIV                       RCC_MCO1CFGR_MCO1DIV_Msk                            /*!< MCO1 prescaler Set and cleared by software to configure the prescaler of the MCO1. Modification of this prescaler may generate glitches on MCO1. It is highly recommended to change this prescaler only after reset, before enabling the external oscillators and the PLLs. Refer to for details. ... */
#define RCC_MCO1CFGR_MCO1DIV_0                     (0x1UL << RCC_MCO1CFGR_MCO1DIV_Pos)                 /*!< 0x00000010 */
#define RCC_MCO1CFGR_MCO1DIV_1                     (0x2UL << RCC_MCO1CFGR_MCO1DIV_Pos)                 /*!< 0x00000020 */
#define RCC_MCO1CFGR_MCO1DIV_2                     (0x4UL << RCC_MCO1CFGR_MCO1DIV_Pos)                 /*!< 0x00000040 */
#define RCC_MCO1CFGR_MCO1DIV_3                     (0x8UL << RCC_MCO1CFGR_MCO1DIV_Pos)                 /*!< 0x00000080 */
#define RCC_MCO1CFGR_MCO1ON_Pos                    (12U)
#define RCC_MCO1CFGR_MCO1ON_Msk                    (0x1UL << RCC_MCO1CFGR_MCO1ON_Pos)                   /*!< 0x00001000 */
#define RCC_MCO1CFGR_MCO1ON                        RCC_MCO1CFGR_MCO1ON_Msk                             /*!< Control of the MCO1 output Set and cleared by software to enable the MCO1 output */

/*****************  Bit definition for RCC_MCO2CFGR register  *****************/
#define RCC_MCO2CFGR_MCO2SEL_Pos                   (0U)
#define RCC_MCO2CFGR_MCO2SEL_Msk                   (0x7UL << RCC_MCO2CFGR_MCO2SEL_Pos)                  /*!< 0x00000007 */
#define RCC_MCO2CFGR_MCO2SEL                       RCC_MCO2CFGR_MCO2SEL_Msk                            /*!< Micro-controller clock output 2 Set and cleared by software. Clock source selection may generate glitches on MCO2. It is highly recommended to configure these bits only after reset, before enabling the external oscillators and the PLLs. others: reserved */
#define RCC_MCO2CFGR_MCO2SEL_0                     (0x1UL << RCC_MCO2CFGR_MCO2SEL_Pos)                  /*!< 0x00000001 */
#define RCC_MCO2CFGR_MCO2SEL_1                     (0x2UL << RCC_MCO2CFGR_MCO2SEL_Pos)                  /*!< 0x00000002 */
#define RCC_MCO2CFGR_MCO2SEL_2                     (0x4UL << RCC_MCO2CFGR_MCO2SEL_Pos)                  /*!< 0x00000004 */
#define RCC_MCO2CFGR_MCO2DIV_Pos                   (4U)
#define RCC_MCO2CFGR_MCO2DIV_Msk                   (0xFUL << RCC_MCO2CFGR_MCO2DIV_Pos)                  /*!< 0x000000F0 */
#define RCC_MCO2CFGR_MCO2DIV                       RCC_MCO2CFGR_MCO2DIV_Msk                            /*!< MCO2 prescaler Set and cleared by software to configure the prescaler of the MCO2. Modification of this prescaler may generate glitches on MCO2. It is highly recommended to change this prescaler only after reset, before enabling the external oscillators and the PLLs. Refer to Section1.4.4: Clock Output generation (MCO1 & MCO2) for details. ... */
#define RCC_MCO2CFGR_MCO2DIV_0                     (0x1UL << RCC_MCO2CFGR_MCO2DIV_Pos)                 /*!< 0x00000010 */
#define RCC_MCO2CFGR_MCO2DIV_1                     (0x2UL << RCC_MCO2CFGR_MCO2DIV_Pos)                 /*!< 0x00000020 */
#define RCC_MCO2CFGR_MCO2DIV_2                     (0x4UL << RCC_MCO2CFGR_MCO2DIV_Pos)                 /*!< 0x00000040 */
#define RCC_MCO2CFGR_MCO2DIV_3                     (0x8UL << RCC_MCO2CFGR_MCO2DIV_Pos)                 /*!< 0x00000080 */
#define RCC_MCO2CFGR_MCO2ON_Pos                    (12U)
#define RCC_MCO2CFGR_MCO2ON_Msk                    (0x1UL << RCC_MCO2CFGR_MCO2ON_Pos)                   /*!< 0x00001000 */
#define RCC_MCO2CFGR_MCO2ON                        RCC_MCO2CFGR_MCO2ON_Msk                             /*!< Control of the MCO2 output Set and cleared by software to enable the MCO2 output */

/*****************  Bit definition for RCC_DBGCFGR register  ******************/
#define RCC_DBGCFGR_TRACEDIV_Pos                   (0U)
#define RCC_DBGCFGR_TRACEDIV_Msk                   (0x7UL << RCC_DBGCFGR_TRACEDIV_Pos)                  /*!< 0x00000007 */
#define RCC_DBGCFGR_TRACEDIV                       RCC_DBGCFGR_TRACEDIV_Msk                            /*!< Clock divider for the trace clock (ck_trace) Written by software to control the ck_trace clock division factor. It is possible to change this division ratio on-the-fly. others: aclk / 16 */
#define RCC_DBGCFGR_TRACEDIV_0                     (0x1UL << RCC_DBGCFGR_TRACEDIV_Pos)                  /*!< 0x00000001 */
#define RCC_DBGCFGR_TRACEDIV_1                     (0x2UL << RCC_DBGCFGR_TRACEDIV_Pos)                  /*!< 0x00000002 */
#define RCC_DBGCFGR_TRACEDIV_2                     (0x4UL << RCC_DBGCFGR_TRACEDIV_Pos)                  /*!< 0x00000004 */
#define RCC_DBGCFGR_DBGCKEN_Pos                    (8U)
#define RCC_DBGCFGR_DBGCKEN_Msk                    (0x1UL << RCC_DBGCFGR_DBGCKEN_Pos)                   /*!< 0x00000100 */
#define RCC_DBGCFGR_DBGCKEN                        RCC_DBGCFGR_DBGCKEN_Msk                             /*!< Clock enable for debug function Set and cleared by software to control the generation of the ck_apb_dbg clock (DEBUG APB clock), the ck_sys_dbg. See for additional information. */
#define RCC_DBGCFGR_TRACECKEN_Pos                  (9U)
#define RCC_DBGCFGR_TRACECKEN_Msk                  (0x1UL << RCC_DBGCFGR_TRACECKEN_Pos)                 /*!< 0x00000200 */
#define RCC_DBGCFGR_TRACECKEN                      RCC_DBGCFGR_TRACECKEN_Msk                           /*!< Clock enable for trace function Set and cleared by software to control the generation of the trace_ck clock. See for additional information. */
#define RCC_DBGCFGR_DBGRST_Pos                     (12U)
#define RCC_DBGCFGR_DBGRST_Msk                     (0x1UL << RCC_DBGCFGR_DBGRST_Pos)                    /*!< 0x00001000 */
#define RCC_DBGCFGR_DBGRST                         RCC_DBGCFGR_DBGRST_Msk                              /*!< Reset of the debug function Set and cleared by software to control the generation of the reset (dbg_rstn) for the trace and debug parts. */

