zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp135cxx_ca7.h
/***************  Bit definition for RCC_UART78CKSELR register  ***************/
#define RCC_UART78CKSELR_UART78SRC_Pos             (0U)
#define RCC_UART78CKSELR_UART78SRC_Msk             (0x7UL << RCC_UART78CKSELR_UART78SRC_Pos)            /*!< 0x00000007 */
#define RCC_UART78CKSELR_UART78SRC                 RCC_UART78CKSELR_UART78SRC_Msk                      /*!< UART7 and UART8 kernel clock source selection Written by software. others: reserved, the kernel clock is disabled */
#define RCC_UART78CKSELR_UART78SRC_0               (0x1UL << RCC_UART78CKSELR_UART78SRC_Pos)            /*!< 0x00000001 */
#define RCC_UART78CKSELR_UART78SRC_1               (0x2UL << RCC_UART78CKSELR_UART78SRC_Pos)            /*!< 0x00000002 */
#define RCC_UART78CKSELR_UART78SRC_2               (0x4UL << RCC_UART78CKSELR_UART78SRC_Pos)            /*!< 0x00000004 */

/***************  Bit definition for RCC_LPTIM1CKSELR register  ***************/
#define RCC_LPTIM1CKSELR_LPTIM1SRC_Pos             (0U)
#define RCC_LPTIM1CKSELR_LPTIM1SRC_Msk             (0x7UL << RCC_LPTIM1CKSELR_LPTIM1SRC_Pos)            /*!< 0x00000007 */
#define RCC_LPTIM1CKSELR_LPTIM1SRC                 RCC_LPTIM1CKSELR_LPTIM1SRC_Msk                      /*!< LPTIM1 kernel clock source selection Written by software. others: the kernel clock is disabled */
#define RCC_LPTIM1CKSELR_LPTIM1SRC_0               (0x1UL << RCC_LPTIM1CKSELR_LPTIM1SRC_Pos)            /*!< 0x00000001 */
#define RCC_LPTIM1CKSELR_LPTIM1SRC_1               (0x2UL << RCC_LPTIM1CKSELR_LPTIM1SRC_Pos)            /*!< 0x00000002 */
#define RCC_LPTIM1CKSELR_LPTIM1SRC_2               (0x4UL << RCC_LPTIM1CKSELR_LPTIM1SRC_Pos)            /*!< 0x00000004 */

/**************  Bit definition for RCC_LPTIM23CKSELR register  ***************/
#define RCC_LPTIM23CKSELR_LPTIM2SRC_Pos            (0U)
#define RCC_LPTIM23CKSELR_LPTIM2SRC_Msk            (0x7UL << RCC_LPTIM23CKSELR_LPTIM2SRC_Pos)           /*!< 0x00000007 */
#define RCC_LPTIM23CKSELR_LPTIM2SRC                RCC_LPTIM23CKSELR_LPTIM2SRC_Msk                     /*!< LPTIM2 kernel clock source selection If LPTIM2 block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Written by software. others: the kernel clock is disabled */
#define RCC_LPTIM23CKSELR_LPTIM2SRC_0              (0x1UL << RCC_LPTIM23CKSELR_LPTIM2SRC_Pos)           /*!< 0x00000001 */
#define RCC_LPTIM23CKSELR_LPTIM2SRC_1              (0x2UL << RCC_LPTIM23CKSELR_LPTIM2SRC_Pos)           /*!< 0x00000002 */
#define RCC_LPTIM23CKSELR_LPTIM2SRC_2              (0x4UL << RCC_LPTIM23CKSELR_LPTIM2SRC_Pos)           /*!< 0x00000004 */
#define RCC_LPTIM23CKSELR_LPTIM3SRC_Pos            (3U)
#define RCC_LPTIM23CKSELR_LPTIM3SRC_Msk            (0x7UL << RCC_LPTIM23CKSELR_LPTIM3SRC_Pos)           /*!< 0x00000038 */
#define RCC_LPTIM23CKSELR_LPTIM3SRC                RCC_LPTIM23CKSELR_LPTIM3SRC_Msk                     /*!< LPTIM3 kernel clock source selection If LPTIM3 block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Written by software. others: the kernel clock is disabled */
#define RCC_LPTIM23CKSELR_LPTIM3SRC_0              (0x1UL << RCC_LPTIM23CKSELR_LPTIM3SRC_Pos)           /*!< 0x00000008 */
#define RCC_LPTIM23CKSELR_LPTIM3SRC_1              (0x2UL << RCC_LPTIM23CKSELR_LPTIM3SRC_Pos)          /*!< 0x00000010 */
#define RCC_LPTIM23CKSELR_LPTIM3SRC_2              (0x4UL << RCC_LPTIM23CKSELR_LPTIM3SRC_Pos)          /*!< 0x00000020 */

/**************  Bit definition for RCC_LPTIM45CKSELR register  ***************/
#define RCC_LPTIM45CKSELR_LPTIM45SRC_Pos           (0U)
#define RCC_LPTIM45CKSELR_LPTIM45SRC_Msk           (0x7UL << RCC_LPTIM45CKSELR_LPTIM45SRC_Pos)          /*!< 0x00000007 */
#define RCC_LPTIM45CKSELR_LPTIM45SRC               RCC_LPTIM45CKSELR_LPTIM45SRC_Msk                    /*!< LPTIM4 and LPTIM5 kernel clock source selection Written by software. others: the kernel clock is disabled */
#define RCC_LPTIM45CKSELR_LPTIM45SRC_0             (0x1UL << RCC_LPTIM45CKSELR_LPTIM45SRC_Pos)          /*!< 0x00000001 */
#define RCC_LPTIM45CKSELR_LPTIM45SRC_1             (0x2UL << RCC_LPTIM45CKSELR_LPTIM45SRC_Pos)          /*!< 0x00000002 */
#define RCC_LPTIM45CKSELR_LPTIM45SRC_2             (0x4UL << RCC_LPTIM45CKSELR_LPTIM45SRC_Pos)          /*!< 0x00000004 */

/****************  Bit definition for RCC_SAI1CKSELR register  ****************/
#define RCC_SAI1CKSELR_SAI1SRC_Pos                 (0U)
#define RCC_SAI1CKSELR_SAI1SRC_Msk                 (0x7UL << RCC_SAI1CKSELR_SAI1SRC_Pos)                /*!< 0x00000007 */
#define RCC_SAI1CKSELR_SAI1SRC                     RCC_SAI1CKSELR_SAI1SRC_Msk                          /*!< SAI1 and DFSDM kernel clock source selection Written by software. others: reserved, the kernel clock is disabled */
#define RCC_SAI1CKSELR_SAI1SRC_0                   (0x1UL << RCC_SAI1CKSELR_SAI1SRC_Pos)                /*!< 0x00000001 */
#define RCC_SAI1CKSELR_SAI1SRC_1                   (0x2UL << RCC_SAI1CKSELR_SAI1SRC_Pos)                /*!< 0x00000002 */
#define RCC_SAI1CKSELR_SAI1SRC_2                   (0x4UL << RCC_SAI1CKSELR_SAI1SRC_Pos)                /*!< 0x00000004 */

/****************  Bit definition for RCC_SAI2CKSELR register  ****************/
#define RCC_SAI2CKSELR_SAI2SRC_Pos                 (0U)
#define RCC_SAI2CKSELR_SAI2SRC_Msk                 (0x7UL << RCC_SAI2CKSELR_SAI2SRC_Pos)                /*!< 0x00000007 */
#define RCC_SAI2CKSELR_SAI2SRC                     RCC_SAI2CKSELR_SAI2SRC_Msk                          /*!< SAI2 kernel clock source selection Written by software. others: reserved, the kernel clock is disabled */
#define RCC_SAI2CKSELR_SAI2SRC_0                   (0x1UL << RCC_SAI2CKSELR_SAI2SRC_Pos)                /*!< 0x00000001 */
#define RCC_SAI2CKSELR_SAI2SRC_1                   (0x2UL << RCC_SAI2CKSELR_SAI2SRC_Pos)                /*!< 0x00000002 */
#define RCC_SAI2CKSELR_SAI2SRC_2                   (0x4UL << RCC_SAI2CKSELR_SAI2SRC_Pos)                /*!< 0x00000004 */

/***************  Bit definition for RCC_FDCANCKSELR register  ****************/
#define RCC_FDCANCKSELR_FDCANSRC_Pos               (0U)
#define RCC_FDCANCKSELR_FDCANSRC_Msk               (0x3UL << RCC_FDCANCKSELR_FDCANSRC_Pos)              /*!< 0x00000003 */
#define RCC_FDCANCKSELR_FDCANSRC                   RCC_FDCANCKSELR_FDCANSRC_Msk                        /*!< FDCAN kernel clock source selection Written by software. others: reserved, the kernel clock is disabled */
#define RCC_FDCANCKSELR_FDCANSRC_0                 (0x1UL << RCC_FDCANCKSELR_FDCANSRC_Pos)              /*!< 0x00000001 */
#define RCC_FDCANCKSELR_FDCANSRC_1                 (0x2UL << RCC_FDCANCKSELR_FDCANSRC_Pos)              /*!< 0x00000002 */

/***************  Bit definition for RCC_SPDIFCKSELR register  ****************/
#define RCC_SPDIFCKSELR_SPDIFSRC_Pos               (0U)
#define RCC_SPDIFCKSELR_SPDIFSRC_Msk               (0x3UL << RCC_SPDIFCKSELR_SPDIFSRC_Pos)              /*!< 0x00000003 */
#define RCC_SPDIFCKSELR_SPDIFSRC                   RCC_SPDIFCKSELR_SPDIFSRC_Msk                        /*!< SPDIFRX kernel clock source selection Written by software. others: reserved, the kernel clock is disabled */
#define RCC_SPDIFCKSELR_SPDIFSRC_0                 (0x1UL << RCC_SPDIFCKSELR_SPDIFSRC_Pos)              /*!< 0x00000001 */
#define RCC_SPDIFCKSELR_SPDIFSRC_1                 (0x2UL << RCC_SPDIFCKSELR_SPDIFSRC_Pos)              /*!< 0x00000002 */

