zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp135cxx_ca7.h
/*************  Bit definition for RCC_MP_S_AHB6ENSETR register  **************/
#define RCC_MP_S_AHB6ENSETR_MDMAEN_Pos             (0U)
#define RCC_MP_S_AHB6ENSETR_MDMAEN_Msk             (0x1UL << RCC_MP_S_AHB6ENSETR_MDMAEN_Pos)            /*!< 0x00000001 */
#define RCC_MP_S_AHB6ENSETR_MDMAEN                 RCC_MP_S_AHB6ENSETR_MDMAEN_Msk                      /*!< MDMA peripheral clocks enable Set by (secure) software. */

/*************  Bit definition for RCC_MP_S_AHB6ENCLRR register  **************/
#define RCC_MP_S_AHB6ENCLRR_MDMAEN_Pos             (0U)
#define RCC_MP_S_AHB6ENCLRR_MDMAEN_Msk             (0x1UL << RCC_MP_S_AHB6ENCLRR_MDMAEN_Pos)            /*!< 0x00000001 */
#define RCC_MP_S_AHB6ENCLRR_MDMAEN                 RCC_MP_S_AHB6ENCLRR_MDMAEN_Msk                      /*!< MDMA peripheral clocks enable Cleared by (secure) software. */

/*************  Bit definition for RCC_MP_NS_AHB6ENSETR register  *************/
#define RCC_MP_NS_AHB6ENSETR_MDMAEN_Pos            (0U)
#define RCC_MP_NS_AHB6ENSETR_MDMAEN_Msk            (0x1UL << RCC_MP_NS_AHB6ENSETR_MDMAEN_Pos)           /*!< 0x00000001 */
#define RCC_MP_NS_AHB6ENSETR_MDMAEN                RCC_MP_NS_AHB6ENSETR_MDMAEN_Msk                     /*!< MDMA peripheral clocks enable Set by software. */

/*************  Bit definition for RCC_MP_NS_AHB6ENCLRR register  *************/
#define RCC_MP_NS_AHB6ENCLRR_MDMAEN_Pos            (0U)
#define RCC_MP_NS_AHB6ENCLRR_MDMAEN_Msk            (0x1UL << RCC_MP_NS_AHB6ENCLRR_MDMAEN_Pos)           /*!< 0x00000001 */
#define RCC_MP_NS_AHB6ENCLRR_MDMAEN                RCC_MP_NS_AHB6ENCLRR_MDMAEN_Msk                     /*!< MDMA peripheral clocks enable Set by software. */

/*************  Bit definition for RCC_MP_APB1LPENSETR register  **************/
#define RCC_MP_APB1LPENSETR_TIM2LPEN_Pos           (0U)
#define RCC_MP_APB1LPENSETR_TIM2LPEN_Msk           (0x1UL << RCC_MP_APB1LPENSETR_TIM2LPEN_Pos)          /*!< 0x00000001 */
#define RCC_MP_APB1LPENSETR_TIM2LPEN               RCC_MP_APB1LPENSETR_TIM2LPEN_Msk                    /*!< TIM2 peripheral clocks enable during CSleep mode Set by software. */
#define RCC_MP_APB1LPENSETR_TIM3LPEN_Pos           (1U)
#define RCC_MP_APB1LPENSETR_TIM3LPEN_Msk           (0x1UL << RCC_MP_APB1LPENSETR_TIM3LPEN_Pos)          /*!< 0x00000002 */
#define RCC_MP_APB1LPENSETR_TIM3LPEN               RCC_MP_APB1LPENSETR_TIM3LPEN_Msk                    /*!< TIM3 peripheral clocks enable during CSleep mode Set by software. */
#define RCC_MP_APB1LPENSETR_TIM4LPEN_Pos           (2U)
#define RCC_MP_APB1LPENSETR_TIM4LPEN_Msk           (0x1UL << RCC_MP_APB1LPENSETR_TIM4LPEN_Pos)          /*!< 0x00000004 */
#define RCC_MP_APB1LPENSETR_TIM4LPEN               RCC_MP_APB1LPENSETR_TIM4LPEN_Msk                    /*!< TIM4 peripheral clocks enable during CSleep mode Set by software. */
#define RCC_MP_APB1LPENSETR_TIM5LPEN_Pos           (3U)
#define RCC_MP_APB1LPENSETR_TIM5LPEN_Msk           (0x1UL << RCC_MP_APB1LPENSETR_TIM5LPEN_Pos)          /*!< 0x00000008 */
#define RCC_MP_APB1LPENSETR_TIM5LPEN               RCC_MP_APB1LPENSETR_TIM5LPEN_Msk                    /*!< TIM5 peripheral clocks enable during CSleep mode Set by software. */
#define RCC_MP_APB1LPENSETR_TIM6LPEN_Pos           (4U)
#define RCC_MP_APB1LPENSETR_TIM6LPEN_Msk           (0x1UL << RCC_MP_APB1LPENSETR_TIM6LPEN_Pos)          /*!< 0x00000010 */
#define RCC_MP_APB1LPENSETR_TIM6LPEN               RCC_MP_APB1LPENSETR_TIM6LPEN_Msk                    /*!< TIM6 peripheral clocks enable during CSleep mode Set by software. */
#define RCC_MP_APB1LPENSETR_TIM7LPEN_Pos           (5U)
#define RCC_MP_APB1LPENSETR_TIM7LPEN_Msk           (0x1UL << RCC_MP_APB1LPENSETR_TIM7LPEN_Pos)          /*!< 0x00000020 */
#define RCC_MP_APB1LPENSETR_TIM7LPEN               RCC_MP_APB1LPENSETR_TIM7LPEN_Msk                    /*!< TIM7 peripheral clocks enable during CSleep mode Set by software. */
#define RCC_MP_APB1LPENSETR_LPTIM1LPEN_Pos         (9U)
#define RCC_MP_APB1LPENSETR_LPTIM1LPEN_Msk         (0x1UL << RCC_MP_APB1LPENSETR_LPTIM1LPEN_Pos)        /*!< 0x00000200 */
#define RCC_MP_APB1LPENSETR_LPTIM1LPEN             RCC_MP_APB1LPENSETR_LPTIM1LPEN_Msk                  /*!< LPTIM1 peripheral clocks enable during CSleep mode Set by software. */
#define RCC_MP_APB1LPENSETR_SPI2LPEN_Pos           (11U)
#define RCC_MP_APB1LPENSETR_SPI2LPEN_Msk           (0x1UL << RCC_MP_APB1LPENSETR_SPI2LPEN_Pos)          /*!< 0x00000800 */
#define RCC_MP_APB1LPENSETR_SPI2LPEN               RCC_MP_APB1LPENSETR_SPI2LPEN_Msk                    /*!< SPI2 peripheral clocks enable during CSleep mode Set by software. */
#define RCC_MP_APB1LPENSETR_SPI3LPEN_Pos           (12U)
#define RCC_MP_APB1LPENSETR_SPI3LPEN_Msk           (0x1UL << RCC_MP_APB1LPENSETR_SPI3LPEN_Pos)          /*!< 0x00001000 */
#define RCC_MP_APB1LPENSETR_SPI3LPEN               RCC_MP_APB1LPENSETR_SPI3LPEN_Msk                    /*!< SPI3 peripheral clocks enable during CSleep mode Set by software. */
#define RCC_MP_APB1LPENSETR_USART3LPEN_Pos         (15U)
#define RCC_MP_APB1LPENSETR_USART3LPEN_Msk         (0x1UL << RCC_MP_APB1LPENSETR_USART3LPEN_Pos)        /*!< 0x00008000 */
#define RCC_MP_APB1LPENSETR_USART3LPEN             RCC_MP_APB1LPENSETR_USART3LPEN_Msk                  /*!< USART3 peripheral clocks enable during CSleep mode Set by software. */
#define RCC_MP_APB1LPENSETR_UART4LPEN_Pos          (16U)
#define RCC_MP_APB1LPENSETR_UART4LPEN_Msk          (0x1UL << RCC_MP_APB1LPENSETR_UART4LPEN_Pos)         /*!< 0x00010000 */
#define RCC_MP_APB1LPENSETR_UART4LPEN              RCC_MP_APB1LPENSETR_UART4LPEN_Msk                   /*!< UART4 peripheral clocks enable during CSleep mode Set by software. */
#define RCC_MP_APB1LPENSETR_UART5LPEN_Pos          (17U)
#define RCC_MP_APB1LPENSETR_UART5LPEN_Msk          (0x1UL << RCC_MP_APB1LPENSETR_UART5LPEN_Pos)         /*!< 0x00020000 */
#define RCC_MP_APB1LPENSETR_UART5LPEN              RCC_MP_APB1LPENSETR_UART5LPEN_Msk                   /*!< UART5 peripheral clocks enable during CSleep mode Set by software. */
#define RCC_MP_APB1LPENSETR_UART7LPEN_Pos          (18U)
#define RCC_MP_APB1LPENSETR_UART7LPEN_Msk          (0x1UL << RCC_MP_APB1LPENSETR_UART7LPEN_Pos)         /*!< 0x00040000 */
#define RCC_MP_APB1LPENSETR_UART7LPEN              RCC_MP_APB1LPENSETR_UART7LPEN_Msk                   /*!< UART7 peripheral clocks enable during CSleep mode Set by software. */
#define RCC_MP_APB1LPENSETR_UART8LPEN_Pos          (19U)
#define RCC_MP_APB1LPENSETR_UART8LPEN_Msk          (0x1UL << RCC_MP_APB1LPENSETR_UART8LPEN_Pos)         /*!< 0x00080000 */
#define RCC_MP_APB1LPENSETR_UART8LPEN              RCC_MP_APB1LPENSETR_UART8LPEN_Msk                   /*!< UART8 peripheral clocks enable during CSleep mode Set by software. */
#define RCC_MP_APB1LPENSETR_I2C1LPEN_Pos           (21U)
#define RCC_MP_APB1LPENSETR_I2C1LPEN_Msk           (0x1UL << RCC_MP_APB1LPENSETR_I2C1LPEN_Pos)          /*!< 0x00200000 */
#define RCC_MP_APB1LPENSETR_I2C1LPEN               RCC_MP_APB1LPENSETR_I2C1LPEN_Msk                    /*!< I2C1 peripheral clocks enable during CSleep mode Set by software. */
#define RCC_MP_APB1LPENSETR_I2C2LPEN_Pos           (22U)
#define RCC_MP_APB1LPENSETR_I2C2LPEN_Msk           (0x1UL << RCC_MP_APB1LPENSETR_I2C2LPEN_Pos)          /*!< 0x00400000 */
#define RCC_MP_APB1LPENSETR_I2C2LPEN               RCC_MP_APB1LPENSETR_I2C2LPEN_Msk                    /*!< I2C2 peripheral clocks enable during CSleep mode Set by software. */
#define RCC_MP_APB1LPENSETR_SPDIFLPEN_Pos          (26U)
#define RCC_MP_APB1LPENSETR_SPDIFLPEN_Msk          (0x1UL << RCC_MP_APB1LPENSETR_SPDIFLPEN_Pos)         /*!< 0x04000000 */
#define RCC_MP_APB1LPENSETR_SPDIFLPEN              RCC_MP_APB1LPENSETR_SPDIFLPEN_Msk                   /*!< SPDIFRX peripheral clocks enable during CSleep mode Set by software. */

