zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp135cxx_ca7.h
/************  Bit definition for RCC_MP_S_AHB6LPENSETR register  *************/
#define RCC_MP_S_AHB6LPENSETR_MDMALPEN_Pos         (0U)
#define RCC_MP_S_AHB6LPENSETR_MDMALPEN_Msk         (0x1UL << RCC_MP_S_AHB6LPENSETR_MDMALPEN_Pos)        /*!< 0x00000001 */
#define RCC_MP_S_AHB6LPENSETR_MDMALPEN             RCC_MP_S_AHB6LPENSETR_MDMALPEN_Msk                  /*!< MDMA peripheral clocks enable during CSleep mode Set by (secure) software. */

/************  Bit definition for RCC_MP_S_AHB6LPENCLRR register  *************/
#define RCC_MP_S_AHB6LPENCLRR_MDMALPEN_Pos         (0U)
#define RCC_MP_S_AHB6LPENCLRR_MDMALPEN_Msk         (0x1UL << RCC_MP_S_AHB6LPENCLRR_MDMALPEN_Pos)        /*!< 0x00000001 */
#define RCC_MP_S_AHB6LPENCLRR_MDMALPEN             RCC_MP_S_AHB6LPENCLRR_MDMALPEN_Msk                  /*!< MDMA peripheral clocks enable during CSleep mode Cleared by (secure) software. */

/************  Bit definition for RCC_MP_NS_AHB6LPENSETR register  ************/
#define RCC_MP_NS_AHB6LPENSETR_MDMALPEN_Pos        (0U)
#define RCC_MP_NS_AHB6LPENSETR_MDMALPEN_Msk        (0x1UL << RCC_MP_NS_AHB6LPENSETR_MDMALPEN_Pos)       /*!< 0x00000001 */
#define RCC_MP_NS_AHB6LPENSETR_MDMALPEN            RCC_MP_NS_AHB6LPENSETR_MDMALPEN_Msk                 /*!< MDMA peripheral clocks enable during CSleep mode Set by software. */

/************  Bit definition for RCC_MP_NS_AHB6LPENCLRR register  ************/
#define RCC_MP_NS_AHB6LPENCLRR_MDMALPEN_Pos        (0U)
#define RCC_MP_NS_AHB6LPENCLRR_MDMALPEN_Msk        (0x1UL << RCC_MP_NS_AHB6LPENCLRR_MDMALPEN_Pos)       /*!< 0x00000001 */
#define RCC_MP_NS_AHB6LPENCLRR_MDMALPEN            RCC_MP_NS_AHB6LPENCLRR_MDMALPEN_Msk                 /*!< MDMA peripheral clocks enable during CSleep mode Cleared by software. */

/************  Bit definition for RCC_MP_S_AXIMLPENSETR register  *************/
#define RCC_MP_S_AXIMLPENSETR_SYSRAMLPEN_Pos       (0U)
#define RCC_MP_S_AXIMLPENSETR_SYSRAMLPEN_Msk       (0x1UL << RCC_MP_S_AXIMLPENSETR_SYSRAMLPEN_Pos)      /*!< 0x00000001 */
#define RCC_MP_S_AXIMLPENSETR_SYSRAMLPEN           RCC_MP_S_AXIMLPENSETR_SYSRAMLPEN_Msk                /*!< SYSRAM interface clock enable during CSleep mode Set by (secure) software. */

/************  Bit definition for RCC_MP_S_AXIMLPENCLRR register  *************/
#define RCC_MP_S_AXIMLPENCLRR_SYSRAMLPEN_Pos       (0U)
#define RCC_MP_S_AXIMLPENCLRR_SYSRAMLPEN_Msk       (0x1UL << RCC_MP_S_AXIMLPENCLRR_SYSRAMLPEN_Pos)      /*!< 0x00000001 */
#define RCC_MP_S_AXIMLPENCLRR_SYSRAMLPEN           RCC_MP_S_AXIMLPENCLRR_SYSRAMLPEN_Msk                /*!< SYSRAM interface clock enable during CSleep mode Cleared by (secure) software. */

/************  Bit definition for RCC_MP_NS_AXIMLPENSETR register  ************/
#define RCC_MP_NS_AXIMLPENSETR_SYSRAMLPEN_Pos      (0U)
#define RCC_MP_NS_AXIMLPENSETR_SYSRAMLPEN_Msk      (0x1UL << RCC_MP_NS_AXIMLPENSETR_SYSRAMLPEN_Pos)     /*!< 0x00000001 */
#define RCC_MP_NS_AXIMLPENSETR_SYSRAMLPEN          RCC_MP_NS_AXIMLPENSETR_SYSRAMLPEN_Msk               /*!< SYSRAM interface clock enable during CSleep mode Set by software. */

/************  Bit definition for RCC_MP_NS_AXIMLPENCLRR register  ************/
#define RCC_MP_NS_AXIMLPENCLRR_SYSRAMLPEN_Pos      (0U)
#define RCC_MP_NS_AXIMLPENCLRR_SYSRAMLPEN_Msk      (0x1UL << RCC_MP_NS_AXIMLPENCLRR_SYSRAMLPEN_Pos)     /*!< 0x00000001 */
#define RCC_MP_NS_AXIMLPENCLRR_SYSRAMLPEN          RCC_MP_NS_AXIMLPENCLRR_SYSRAMLPEN_Msk               /*!< SYSRAM interface clock enable during CSleep mode Cleared by software. */

/*************  Bit definition for RCC_MP_MLAHBLPENSETR register  *************/
#define RCC_MP_MLAHBLPENSETR_SRAM1LPEN_Pos         (0U)
#define RCC_MP_MLAHBLPENSETR_SRAM1LPEN_Msk         (0x1UL << RCC_MP_MLAHBLPENSETR_SRAM1LPEN_Pos)        /*!< 0x00000001 */
#define RCC_MP_MLAHBLPENSETR_SRAM1LPEN             RCC_MP_MLAHBLPENSETR_SRAM1LPEN_Msk                  /*!< SRAM1 interface clock enable during CSleep mode If SRAM1 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_MLAHBLPENSETR_SRAM2LPEN_Pos         (1U)
#define RCC_MP_MLAHBLPENSETR_SRAM2LPEN_Msk         (0x1UL << RCC_MP_MLAHBLPENSETR_SRAM2LPEN_Pos)        /*!< 0x00000002 */
#define RCC_MP_MLAHBLPENSETR_SRAM2LPEN             RCC_MP_MLAHBLPENSETR_SRAM2LPEN_Msk                  /*!< SRAM2 interface clock enable during CSleep mode If SRAM2 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_MLAHBLPENSETR_SRAM3LPEN_Pos         (2U)
#define RCC_MP_MLAHBLPENSETR_SRAM3LPEN_Msk         (0x1UL << RCC_MP_MLAHBLPENSETR_SRAM3LPEN_Pos)        /*!< 0x00000004 */
#define RCC_MP_MLAHBLPENSETR_SRAM3LPEN             RCC_MP_MLAHBLPENSETR_SRAM3LPEN_Msk                  /*!< SRAM3 interface clock enable during CSleep mode If SRAM3 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */

/*************  Bit definition for RCC_MP_MLAHBLPENCLRR register  *************/
#define RCC_MP_MLAHBLPENCLRR_SRAM1LPEN_Pos         (0U)
#define RCC_MP_MLAHBLPENCLRR_SRAM1LPEN_Msk         (0x1UL << RCC_MP_MLAHBLPENCLRR_SRAM1LPEN_Pos)        /*!< 0x00000001 */
#define RCC_MP_MLAHBLPENCLRR_SRAM1LPEN             RCC_MP_MLAHBLPENCLRR_SRAM1LPEN_Msk                  /*!< SRAM1 interface clock enable during CSleep mode If SRAM1 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_MLAHBLPENCLRR_SRAM2LPEN_Pos         (1U)
#define RCC_MP_MLAHBLPENCLRR_SRAM2LPEN_Msk         (0x1UL << RCC_MP_MLAHBLPENCLRR_SRAM2LPEN_Pos)        /*!< 0x00000002 */
#define RCC_MP_MLAHBLPENCLRR_SRAM2LPEN             RCC_MP_MLAHBLPENCLRR_SRAM2LPEN_Msk                  /*!< SRAM2 interface clock enable during CSleep mode If SRAM2 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_MLAHBLPENCLRR_SRAM3LPEN_Pos         (2U)
#define RCC_MP_MLAHBLPENCLRR_SRAM3LPEN_Msk         (0x1UL << RCC_MP_MLAHBLPENCLRR_SRAM3LPEN_Pos)        /*!< 0x00000004 */
#define RCC_MP_MLAHBLPENCLRR_SRAM3LPEN             RCC_MP_MLAHBLPENCLRR_SRAM3LPEN_Msk                  /*!< SRAM3 interface clock enable during CSleep mode If SRAM3 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */

/****************  Bit definition for RCC_APB3SECSR register  *****************/
#define RCC_APB3SECSR_LPTIM2SECF_Pos               (0U)
#define RCC_APB3SECSR_LPTIM2SECF_Msk               (0x1UL << RCC_APB3SECSR_LPTIM2SECF_Pos)              /*!< 0x00000001 */
#define RCC_APB3SECSR_LPTIM2SECF                   RCC_APB3SECSR_LPTIM2SECF_Msk                        /*!< LPTIM2 block secure status flag This bit reflects the LPTIM2 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register. */
#define RCC_APB3SECSR_LPTIM3SECF_Pos               (1U)
#define RCC_APB3SECSR_LPTIM3SECF_Msk               (0x1UL << RCC_APB3SECSR_LPTIM3SECF_Pos)              /*!< 0x00000002 */
#define RCC_APB3SECSR_LPTIM3SECF                   RCC_APB3SECSR_LPTIM3SECF_Msk                        /*!< LPTIM3 block secure status flag This bit reflects the LPTIM3 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register. */
#define RCC_APB3SECSR_VREFSECF_Pos                 (13U)
#define RCC_APB3SECSR_VREFSECF_Msk                 (0x1UL << RCC_APB3SECSR_VREFSECF_Pos)                /*!< 0x00002000 */
#define RCC_APB3SECSR_VREFSECF                     RCC_APB3SECSR_VREFSECF_Msk                          /*!< VREF block secure status flag This bit reflects the VREF block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register. */

/****************  Bit definition for RCC_APB4SECSR register  *****************/
#define RCC_APB4SECSR_DCMIPPSECF_Pos               (1U)
#define RCC_APB4SECSR_DCMIPPSECF_Msk               (0x1UL << RCC_APB4SECSR_DCMIPPSECF_Pos)              /*!< 0x00000002 */
#define RCC_APB4SECSR_DCMIPPSECF                   RCC_APB4SECSR_DCMIPPSECF_Msk                        /*!< DCMIPP block secure status flag This bit reflects the DCMIPP block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register. */
#define RCC_APB4SECSR_USBPHYSECF_Pos               (16U)
#define RCC_APB4SECSR_USBPHYSECF_Msk               (0x1UL << RCC_APB4SECSR_USBPHYSECF_Pos)              /*!< 0x00010000 */
#define RCC_APB4SECSR_USBPHYSECF                   RCC_APB4SECSR_USBPHYSECF_Msk                        /*!< USBPHY block secure status flag This bit reflects the USBPHY block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register. */

/****************  Bit definition for RCC_APB5SECSR register  *****************/
#define RCC_APB5SECSR_RTCSECF_Pos                  (8U)
#define RCC_APB5SECSR_RTCSECF_Msk                  (0x1UL << RCC_APB5SECSR_RTCSECF_Pos)                 /*!< 0x00000100 */
#define RCC_APB5SECSR_RTCSECF                      RCC_APB5SECSR_RTCSECF_Msk                           /*!< RTC block secure status flag This bit reflects the RTC block secure state. If at least one function of the RTC is configured as secure via the RTC_SECCFGR register (i.e. if the input signal rtc_sec driven by RTC is asserted), this bit is asserted. */
#define RCC_APB5SECSR_TZCSECF_Pos                  (11U)
#define RCC_APB5SECSR_TZCSECF_Msk                  (0x1UL << RCC_APB5SECSR_TZCSECF_Pos)                 /*!< 0x00000800 */
#define RCC_APB5SECSR_TZCSECF                      RCC_APB5SECSR_TZCSECF_Msk                           /*!< TZC block secure status flag This bit reflects the TZC block secure state. */
#define RCC_APB5SECSR_ETZPCSECF_Pos                (13U)
#define RCC_APB5SECSR_ETZPCSECF_Msk                (0x1UL << RCC_APB5SECSR_ETZPCSECF_Pos)               /*!< 0x00002000 */
#define RCC_APB5SECSR_ETZPCSECF                    RCC_APB5SECSR_ETZPCSECF_Msk                         /*!< ETZPC block secure status flag This bit reflects the ETZPC block secure state. */
#define RCC_APB5SECSR_IWDG1SECF_Pos                (15U)
#define RCC_APB5SECSR_IWDG1SECF_Msk                (0x1UL << RCC_APB5SECSR_IWDG1SECF_Pos)               /*!< 0x00008000 */
#define RCC_APB5SECSR_IWDG1SECF                    RCC_APB5SECSR_IWDG1SECF_Msk                         /*!< IWDG1 block secure status flag This bit reflects the IWDG1 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register. */
#define RCC_APB5SECSR_BSECSECF_Pos                 (16U)
#define RCC_APB5SECSR_BSECSECF_Msk                 (0x1UL << RCC_APB5SECSR_BSECSECF_Pos)                /*!< 0x00010000 */
#define RCC_APB5SECSR_BSECSECF                     RCC_APB5SECSR_BSECSECF_Msk                          /*!< BSEC block secure status flag This bit reflects the BSEC block secure state. */
#define RCC_APB5SECSR_STGENCSECF_Pos               (20U)
#define RCC_APB5SECSR_STGENCSECF_Msk               (0x3UL << RCC_APB5SECSR_STGENCSECF_Pos)              /*!< 0x00300000 */
#define RCC_APB5SECSR_STGENCSECF                   RCC_APB5SECSR_STGENCSECF_Msk                        /*!< STGENC block secure status flag This field reflects the STGENC block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register. */
#define RCC_APB5SECSR_STGENCSECF_0                 (0x1UL << RCC_APB5SECSR_STGENCSECF_Pos)         /*!< 0x00100000 */
#define RCC_APB5SECSR_STGENCSECF_1                 (0x2UL << RCC_APB5SECSR_STGENCSECF_Pos)         /*!< 0x00200000 */

/****************  Bit definition for RCC_APB6SECSR register  *****************/
#define RCC_APB6SECSR_USART1SECF_Pos               (0U)
#define RCC_APB6SECSR_USART1SECF_Msk               (0x1UL << RCC_APB6SECSR_USART1SECF_Pos)              /*!< 0x00000001 */
#define RCC_APB6SECSR_USART1SECF                   RCC_APB6SECSR_USART1SECF_Msk                        /*!< USART1 block secure status flag This bit reflects the USART1 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register. */
#define RCC_APB6SECSR_USART2SECF_Pos               (1U)
#define RCC_APB6SECSR_USART2SECF_Msk               (0x1UL << RCC_APB6SECSR_USART2SECF_Pos)              /*!< 0x00000002 */
#define RCC_APB6SECSR_USART2SECF                   RCC_APB6SECSR_USART2SECF_Msk                        /*!< USART2 block secure status flag This bit reflects the USART2 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register. */
#define RCC_APB6SECSR_SPI4SECF_Pos                 (2U)
#define RCC_APB6SECSR_SPI4SECF_Msk                 (0x1UL << RCC_APB6SECSR_SPI4SECF_Pos)                /*!< 0x00000004 */
#define RCC_APB6SECSR_SPI4SECF                     RCC_APB6SECSR_SPI4SECF_Msk                          /*!< SPI4 block secure status flag This bit reflects the SPI4 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register. */
#define RCC_APB6SECSR_SPI5SECF_Pos                 (3U)
#define RCC_APB6SECSR_SPI5SECF_Msk                 (0x1UL << RCC_APB6SECSR_SPI5SECF_Pos)                /*!< 0x00000008 */
#define RCC_APB6SECSR_SPI5SECF                     RCC_APB6SECSR_SPI5SECF_Msk                          /*!< SPI5 block secure status flag This bit reflects the SPI5 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register. */
#define RCC_APB6SECSR_I2C3SECF_Pos                 (4U)
#define RCC_APB6SECSR_I2C3SECF_Msk                 (0x1UL << RCC_APB6SECSR_I2C3SECF_Pos)                /*!< 0x00000010 */
#define RCC_APB6SECSR_I2C3SECF                     RCC_APB6SECSR_I2C3SECF_Msk                          /*!< I2C3 block secure status flag This bit reflects the I2C3 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register. */
#define RCC_APB6SECSR_I2C4SECF_Pos                 (5U)
#define RCC_APB6SECSR_I2C4SECF_Msk                 (0x1UL << RCC_APB6SECSR_I2C4SECF_Pos)                /*!< 0x00000020 */
#define RCC_APB6SECSR_I2C4SECF                     RCC_APB6SECSR_I2C4SECF_Msk                          /*!< I2C4 block secure status flag This bit reflects the I2C4 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register. */
#define RCC_APB6SECSR_I2C5SECF_Pos                 (6U)
#define RCC_APB6SECSR_I2C5SECF_Msk                 (0x1UL << RCC_APB6SECSR_I2C5SECF_Pos)                /*!< 0x00000040 */
#define RCC_APB6SECSR_I2C5SECF                     RCC_APB6SECSR_I2C5SECF_Msk                          /*!< I2C5 block secure status flag This bit reflects the I2C5 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register. */
#define RCC_APB6SECSR_TIM12SECF_Pos                (7U)
#define RCC_APB6SECSR_TIM12SECF_Msk                (0x1UL << RCC_APB6SECSR_TIM12SECF_Pos)               /*!< 0x00000080 */
#define RCC_APB6SECSR_TIM12SECF                    RCC_APB6SECSR_TIM12SECF_Msk                         /*!< TIM12 block secure status flag This bit reflects the TIM12 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register. */
#define RCC_APB6SECSR_TIM13SECF_Pos                (8U)
#define RCC_APB6SECSR_TIM13SECF_Msk                (0x1UL << RCC_APB6SECSR_TIM13SECF_Pos)               /*!< 0x00000100 */
#define RCC_APB6SECSR_TIM13SECF                    RCC_APB6SECSR_TIM13SECF_Msk                         /*!< TIM13 block secure status flag This bit reflects the TIM13 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register. */
#define RCC_APB6SECSR_TIM14SECF_Pos                (9U)
#define RCC_APB6SECSR_TIM14SECF_Msk                (0x1UL << RCC_APB6SECSR_TIM14SECF_Pos)               /*!< 0x00000200 */
#define RCC_APB6SECSR_TIM14SECF                    RCC_APB6SECSR_TIM14SECF_Msk                         /*!< TIM14 block secure status flag This bit reflects the TIM14 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register. */
#define RCC_APB6SECSR_TIM15SECF_Pos                (10U)
#define RCC_APB6SECSR_TIM15SECF_Msk                (0x1UL << RCC_APB6SECSR_TIM15SECF_Pos)               /*!< 0x00000400 */
#define RCC_APB6SECSR_TIM15SECF                    RCC_APB6SECSR_TIM15SECF_Msk                         /*!< TIM15 block secure status flag This bit reflects the TIM15 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register. */
#define RCC_APB6SECSR_TIM16SECF_Pos                (11U)
#define RCC_APB6SECSR_TIM16SECF_Msk                (0x1UL << RCC_APB6SECSR_TIM16SECF_Pos)               /*!< 0x00000800 */
#define RCC_APB6SECSR_TIM16SECF                    RCC_APB6SECSR_TIM16SECF_Msk                         /*!< TIM16 block secure status flag This bit reflects the TIM16 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register. */
#define RCC_APB6SECSR_TIM17SECF_Pos                (12U)
#define RCC_APB6SECSR_TIM17SECF_Msk                (0x1UL << RCC_APB6SECSR_TIM17SECF_Pos)               /*!< 0x00001000 */
#define RCC_APB6SECSR_TIM17SECF                    RCC_APB6SECSR_TIM17SECF_Msk                         /*!< TIM17 block secure status flag This bit reflects the TIM17 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register. */

/****************  Bit definition for RCC_AHB2SECSR register  *****************/
#define RCC_AHB2SECSR_DMA3SECF_Pos                 (3U)
#define RCC_AHB2SECSR_DMA3SECF_Msk                 (0x1UL << RCC_AHB2SECSR_DMA3SECF_Pos)                /*!< 0x00000008 */
#define RCC_AHB2SECSR_DMA3SECF                     RCC_AHB2SECSR_DMA3SECF_Msk                          /*!< DMA3 block secure status flag This bit reflects the DMA3 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register. */
#define RCC_AHB2SECSR_DMAMUX2SECF_Pos              (4U)
#define RCC_AHB2SECSR_DMAMUX2SECF_Msk              (0x1UL << RCC_AHB2SECSR_DMAMUX2SECF_Pos)             /*!< 0x00000010 */
#define RCC_AHB2SECSR_DMAMUX2SECF                  RCC_AHB2SECSR_DMAMUX2SECF_Msk                       /*!< DMAMUX2 block secure status flag This bit reflects the DMAMUX2 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register. */
#define RCC_AHB2SECSR_ADC1SECF_Pos                 (5U)
#define RCC_AHB2SECSR_ADC1SECF_Msk                 (0x1UL << RCC_AHB2SECSR_ADC1SECF_Pos)                /*!< 0x00000020 */
#define RCC_AHB2SECSR_ADC1SECF                     RCC_AHB2SECSR_ADC1SECF_Msk                          /*!< ADC1 block secure status flag This bit reflects the ADC1 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register. */
#define RCC_AHB2SECSR_ADC2SECF_Pos                 (6U)
#define RCC_AHB2SECSR_ADC2SECF_Msk                 (0x1UL << RCC_AHB2SECSR_ADC2SECF_Pos)                /*!< 0x00000040 */
#define RCC_AHB2SECSR_ADC2SECF                     RCC_AHB2SECSR_ADC2SECF_Msk                          /*!< ADC2 block secure status flag This bit reflects the ADC2 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register. */
#define RCC_AHB2SECSR_USBOSECF_Pos                 (8U)
#define RCC_AHB2SECSR_USBOSECF_Msk                 (0x1UL << RCC_AHB2SECSR_USBOSECF_Pos)                /*!< 0x00000100 */
#define RCC_AHB2SECSR_USBOSECF                     RCC_AHB2SECSR_USBOSECF_Msk                          /*!< USBO block secure status flag This bit reflects the USBO block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register. */

/****************  Bit definition for RCC_AHB5SECSR register  *****************/
#define RCC_AHB5SECSR_PKASECF_Pos                  (2U)
#define RCC_AHB5SECSR_PKASECF_Msk                  (0x1UL << RCC_AHB5SECSR_PKASECF_Pos)                 /*!< 0x00000004 */
#define RCC_AHB5SECSR_PKASECF                      RCC_AHB5SECSR_PKASECF_Msk                           /*!< PKA block secure status flag This bit reflects the PKA block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register. */
#define RCC_AHB5SECSR_SAESSECF_Pos                 (3U)
#define RCC_AHB5SECSR_SAESSECF_Msk                 (0x1UL << RCC_AHB5SECSR_SAESSECF_Pos)                /*!< 0x00000008 */
#define RCC_AHB5SECSR_SAESSECF                     RCC_AHB5SECSR_SAESSECF_Msk                          /*!< SAES block secure status flag This bit reflects the SAES block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register. */
#define RCC_AHB5SECSR_CRYP1SECF_Pos                (4U)
#define RCC_AHB5SECSR_CRYP1SECF_Msk                (0x1UL << RCC_AHB5SECSR_CRYP1SECF_Pos)               /*!< 0x00000010 */
#define RCC_AHB5SECSR_CRYP1SECF                    RCC_AHB5SECSR_CRYP1SECF_Msk                         /*!< CRYP1 block secure status flag This bit reflects the CRYP1 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register. */
#define RCC_AHB5SECSR_HASH1SECF_Pos                (5U)
#define RCC_AHB5SECSR_HASH1SECF_Msk                (0x1UL << RCC_AHB5SECSR_HASH1SECF_Pos)               /*!< 0x00000020 */
#define RCC_AHB5SECSR_HASH1SECF                    RCC_AHB5SECSR_HASH1SECF_Msk                         /*!< HASH1 block secure status flag This bit reflects the HASH1 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register. */
#define RCC_AHB5SECSR_RNG1SECF_Pos                 (6U)
#define RCC_AHB5SECSR_RNG1SECF_Msk                 (0x1UL << RCC_AHB5SECSR_RNG1SECF_Pos)                /*!< 0x00000040 */
#define RCC_AHB5SECSR_RNG1SECF                     RCC_AHB5SECSR_RNG1SECF_Msk                          /*!< RNG1 block secure status flag This bit reflects the RNG1 block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register. */
#define RCC_AHB5SECSR_BKPSRAMSECF_Pos              (8U)
#define RCC_AHB5SECSR_BKPSRAMSECF_Msk              (0x1UL << RCC_AHB5SECSR_BKPSRAMSECF_Pos)             /*!< 0x00000100 */
#define RCC_AHB5SECSR_BKPSRAMSECF                  RCC_AHB5SECSR_BKPSRAMSECF_Msk                       /*!< BKPSRAM block secure status flag This bit reflects the BKPSRAM block secure state, as configured via the corresponding DECPROT[1] field of the ETZPC register. */

